{
  "asignaturas": [
    {
      "codigo": "3010440",
      "nombre": "Calidad de software",
      "creditos": 3,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [
        "3007852",
        "3007853",
        "3007744"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Hoy en dia la calidad se ha convertido en un aspecto importante en el contexto del desarrollo de software. La competitividad del mercado y los nuevos avances tecnológicos requieren de mayor innovación y calidad en los productos. Cada vez se incrementa el número de procesadores, se agregan nuevas funcionalidades, se requiere de nuevas características de conectividad, de seguridad, de interoperabilidad entre muchas otras. El riesgo de fallos en los sistemas aumenta conforme la creciente complejidad tecnológica y contenido software]. Evidencia de ello es el incremento de reportes de incidentes con software. En esta asignatura se presentan los conceptos básicos en sistemas de gestion de calidad, proceso software, modelos de calidad y métricas, de tal forma que pueda ser llevado a contextos industriales. OBJETIVO GENERAL Promover la cultura de la calidad en las diferentes fases del ciclo de vida del software, como una manera de garantizar la entrega de buenas aplicaciones. OBJETIVOS ESPECIFICOS 1. Lograr la difusión de los lineamientos teóricos y los diferentes estándares asociados con procesos de calidad del software. 2. Establecer los métodos necesarios para incorporar los estándares en las diferentes organizaciones de software. 3. Promover los procesos de ejecución de pruebas al interior de las organizaciones para garantizar la calidad de los productos.",
      "avance": false,
      "avanceTipologia": "",
      "avancePorcentaje": ""
    },
    {
      "codigo": "3011020",
      "nombre": "Fundamentos de analítica",
      "creditos": 3,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [
        "3010651",
        "3007847",
        "3007741",
        "3007744",
        "3010435",
        "1000003-M",
        "1000005-M"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "La Analítica se refiere al uso de grandes volúmenes de datos para el análisis y la toma de decisiones en contextos empresariales y de negocios. En esta área confluyen los conocimientos y saberes propios de cuatro grandes áreas de conocimiento: la computación, la estadística, el aprendizaje de máquinas y la investigación de operaciones. En este curso se abordan sus elementos fundamentales de la analítica y se busca que el estudiante desarrolle conocimientos, destrezas y habilidades básicas para la manipulación y modelado de grandes volúmenes de datos y la toma de decisiones.",
      "avance": false,
      "avanceTipologia": "",
      "avancePorcentaje": ""
    },
    {
      "codigo": "3010435",
      "nombre": "Fundamentos de programación",
      "creditos": 3,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "DESCRIPCION El objetivo de este curso es introducir al estudiante en las técnicas básicas de programación. Busca desarrollar en el estudiante la capacidad el analisis de problemas y su solución empleando algoritmos. Para lograr este objetivo el alumno debe adquirir una serie de conocimientos, capacidades y aptitudes que le permitan enfrentar diversas situciones en relacionadas conb su carrera. OBJETIVO GENERAL Desarrollar en el estudiante la capacidad de analisis necesario para abordar problemas cuya solución pueda ser alcanzada empleando algoritmos. OBJETIVOS ESPECIFICOS 1. Comprender los fundamentos de la programación. 2. Entender los mecanismos de la programación estructurada. 3. Entender el flujo de ejecución de un programa de computador. 4. Analizar problemas y desarrollar su solución mediante algoritmos.",
      "avance": false,
      "avanceTipologia": "",
      "avancePorcentaje": ""
    },
    {
      "codigo": "3010408",
      "nombre": "Fundamentos de proyectos en ingeniería",
      "creditos": 3,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "El objetivo principal del curso, que utiliza la metodología de aprendizaje basado en proyectos, es desarrollar pensamiento crítico y habilidades para resolver problemas, analizando el entorno y desarrollando el estado del arte del tema a trabajar para plantear soluciones a problemas reales. A través del trabajo en equipo de un proyecto, el estudiante desarrolla habilidades profesionales transversales, tales como comunicación (escrita y oral), toma de decisiones, trabajo en equipo y gestión de proyectos. Objetivos - Conocer y aplicar técnicas de identificación, caracterización y análisis de problemáticas, problemas, necesidades u oportunidades (PNO) en ing. - Plantear y analizar alternativas de solución en ing. - Plantear soluciones en ing. adaptadas a PNO reales y/o locales. - Identificar costos de la propuesta. Temas que aportan conocimiento nuevo para desarrollar capacidades de formulación y ejecución de proyectos: - Marco Lógico. - Introducción al diseño en Ing. - Búsqueda de información relevante. - Toma de decisiones en ing. - Análisis básico de costos. El curso se enmarca en la identificación de una PNO del contexto real, el estudiante tiene la posibilidad de explorar temas de interés. Los proyectos pueden tener diferentes orígenes. Autocoevaluación aplicada a la nota final, instrumento que permite la evaluación entre los integrantes de cada equipo. Las notas serán las correspondientes al integrante que menos saque. Cada nota se relaciona con el trabajo en equipo. PRÁCTICA: el desarrollo de los temas de la asignatura podrá tener como complemento el desarrollo de prácticas extramurales, visitas técnicas, salidas de campo; en la ciudad de Medellín o en los Municipios del departamento de Antioquia; las cuales estarán supeditadas al cumplimiento de los requerimientos definidos por la Universidad Nacional de Colombia.Tendrá una duración de 1 o máximo 2 días según el alcance de la práctica(aprobado por el CFM 5/12/2024 oficio M.FM.1.004-7224 del 6/12/2024).",
      "avance": false,
      "avanceTipologia": "",
      "avancePorcentaje": ""
    },
    {
      "codigo": "3007852",
      "nombre": "INGENIERÍA DE REQUISITOS",
      "creditos": 3,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [
        "3007853",
        "3007744",
        "3010435"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS: OBJETIVO GENERAL: Practicar los conocimientos adquiridos en las asignaturas previas en la elaboración de las fases de definición y análisis de un Sistema Informático que solucione los problemas particulares de una organización. OBJETIVOS ESPECÍFICOS: - Identificar el dominio de un problema particular, reconociendo sus problemas y el entorno de la organización. - Conceptualizar una solución informática que tome en consideración los problemas de la organización. - Especificar la solución empleando para ello métodos formales y semiformales. METODOLOGÍA Y EVALUACIÓN: - Clases Magistrales. - Elaboración de un Trabajo Práctico por entregas. - Foros de Discusión."
    },
    {
      "codigo": "3007853",
      "nombre": "INGENIERÍA DE SOFTWARE",
      "creditos": 3,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [
        "3007744",
        "3010435"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS: Objetivo General: Desarrollar habilidades de modelado con miras al desarrollo de Soluciones Informáticas a problemas prácticos, empleando para ello un enfoque metodológico. Objetivos Específicos: - Caracterizar los diferentes modelos de UML y otros paradigmas necesarios para la definición, análisis y diseño orientados a objetos de soluciones informáticas. - Emplear los lineamientos teóricos del objetivo anterior en la elaboración del prototipo de una solución informática a un problema planteado. - Garantizar el desarrollo de habilidades para la elaboración de modelos en diferentes métodos de desarrollo."
    },
    {
      "codigo": "3010438",
      "nombre": "Introducción a la ingeniería de sistemas e informática",
      "creditos": 2,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "DESCRIPCIÓN Esta asignatura busca desarrollar en los participantes una visión general y contextualizada del quehacer de un Ingeniero de Sistemas, mediante la interacción con otros alumnos, profesores y profesionales del área. Adicionalmente, pretende desarrollar capacidad individual y grupal para el desarrollo del proceso de aprendizaje mediante proyectos. OBJETIVO GENERAL Desarrollar en el estudiante una visión general de la ingeniería en sistemas, áreas de desempeño, impacto social e implicaciones actuales y futuras. OBJETIVOS ESPECÍFICOS 1. Conocer la importancia de la profesión de ingeniería de sistemas. 2. Identificar los problemas básicos de la ingeniería de sistemas. 3. Iniciar a los estudiantes en el conocimiento de la metodología de trabajo en ingeniería"
    },
    {
      "codigo": "3010476",
      "nombre": "Introducción a la inteligencia artificial",
      "creditos": 3,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [
        "3010651",
        "3007847",
        "3007741",
        "3007744",
        "1000003-M",
        "1000005-M"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "El objetivo de la asignatura es ofrecer una introducción a la Inteligencia Artificial: sus fundamentos, áreas de aplicación y problemas que intenta resolver, así como desarrollar un conjunto de las técnicas más usadas en este campo. En particular se estudiarán diferentes sistemas desarrollados en IA, así como modelos representación del conocimiento."
    },
    {
      "codigo": "3010415",
      "nombre": "Introducción al análisis de decisiones",
      "creditos": 3,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [
        "3007331",
        "3010651",
        "3007324",
        "3010435",
        "1000003-M",
        "1000005-M"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Objetivo: Brindar a los estudiantes elementos y herramientas de la teoría moderna de análisis de decisiones, así como diferentes herramientas de software, para enfrentar los procesos de toma de decisión al interior de la organización. Objetivos Específicos - Enseñar las diferencias existentes entre Modelación de Decisiones, Modelación de Incertidumbres y Modelación de Preferencias. - Presentar y discutir los posibles criterios a tener en cuenta en los procesos de toma de decisiones. - Presentar y discutir algunos métodos de análisis multiobjetivo y sus aplicaciones en procesos de toma de decisiones. - Aprender a manejar algunos sistemas soporte a la decisión. Metodología: Exposiciones magistrales presentadas por medio de Video Beam, y copias de las clases y difusión de información vía Internet. Realización de por lo menos, cuatro parciales y dos trabajos"
    },
    {
      "codigo": "3007324",
      "nombre": "INVESTIGACIÓN DE OPERACIONES I",
      "creditos": 3,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [
        "1000003-M",
        "3010435"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVO Proporcionar herramientas avanzadas de investigación de operaciones que le permitan al ingeniero estudiar y planificar sistemas complejos con el fin de plantear alternativas que en lo posible sean óptimas para su adecuado funcionamiento tales como: programación lineal, programación dinámica y programación y control de proyectos."
    },
    {
      "codigo": "3007744",
      "nombre": "PROGRAMACIÓN ORIENTADA A OBJETOS",
      "creditos": 3,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [
        "3010435"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS: 1.1 GENERAL: Presentar al estudiante los conceptos y técnicas asociados al desarrollo de aplicaciones informáticas, con base en el paradigma de los objetos. 1.2 ESPECÍFICOS: - Presentar tanto los elementos conceptuales como ejemplos y aplicaciones del paradigma de los objetos. - Introducir los tópicos relacionados con el paradigma de los objetos con independencia del lenguaje de programación, haciendo énfasis en los aspectos conceptuales y en los aspectos arquitectónicos del diseño. - Usar el paradigma de los objetos, en el contexto de los diferentes modelos lingüísticos, a través de ejemplos y cumplimiento de objetivos de trabajo. (se trabajarán en particular el lenguaje C++ -Microsoft Visual C++- y el lenguaje SMALLTALK)."
    },
    {
      "codigo": "3010439",
      "nombre": "Proyecto Integrado de Ingeniería",
      "creditos": 4,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "El objetivo principal de este curso, que utiliza la metodología de aprendizaje basado en proyectos, es desarrollar en el estudiante pensamiento crítico y habilidades para resolver problemas, mediante el análisis del entorno y la búsqueda del estado del arte en el tema a desarrollar, y plantear soluciones sostenibles a problemas reales. A través del trabajo en un proyecto de equipo, y del conocimiento de otros proyectos, el estudiante también desarrolla habilidades profesionales transversales, tales como la comunicación (escrita y oral), la toma de decisiones, el trabajo en equipo y la gestión de proyectos. Objetivos del curso. - Formular un proyecto de ingeniería dirigido a la solución de un problema real o al aprovechamiento de una oportunidad. - Adquirir habilidades de gestión y planeación de proyectos de ingeniería. - Adquirir conocimientos sobre métodos, estrategias y técnicas para el diseño en ingeniería. - Proponer y desarrollar una solución real aplicando conceptos de diseño en ingeniería a nivel técnico, ambiental y financiero. - Evaluar la viabilidad técnica, financiera y ambiental mediante técnicas de análisis, modelos y prototipos de funcionamiento. Autocoevaluación aplicada a la nota final del proyecto (100%), se aplicará un instrumento que permita la evaluación entre los integrantes del grupo y los equipos conformados a su interior. Las notas del equipo serán las correspondientes al integrante que menos saque. Cada nota es relacionada con el trabajo en equipo. PRÁCTICA: el desarrollo de los temas de la asignatura podrá tener como complemento el desarrollo de prácticas extramurales, visitas técnicas, salidas de campo; en la ciudad de Medellín o en los Municipios del departamento de Antioquia; las cuales estarán supeditadas al cumplimiento de los requerimientos definidos por la Universidad Nacional de Colombia. Tendrá una duración de 1 o máximo 2 días según el alcance de la práctica (Consejo de la Facultad de Minas el 5 de diciembre de 2024, Acta 33)."
    },
    {
      "codigo": "3007865",
      "nombre": "REDES Y TELECOMUNICACIONES I",
      "creditos": 3,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [
        "3007867",
        "3010426",
        "3006906",
        "3010435"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVO GENERAL: Al finalizar el curso, el estudiante estará en capacidad de distinguir las distintas tipologías de redes para comunicar varios computadores y aplicar técnicas para desarrollar aplicaciones que utilicen una red; teniendo en cuenta las distintas arquitecturas en cada capa o nivel de abstracción. OBJETIVOS ESPECIFICOS: - Identificar los elementos involucrados en una red de computadores. - Diferenciar las capas o niveles para el establecimiento de una red. - Diseñar redes de telecomunicaciones. - Detectar y resolver problemas en la comunicación de datos entre dos máquinas conectadas."
    },
    {
      "codigo": "3007331",
      "nombre": "SIMULACIÓN DE SISTEMAS",
      "creditos": 3,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [
        "3010651",
        "3007324",
        "3010435",
        "1000003-M",
        "1000005-M"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS: El objetivo general está compuesto por dos partes. En su primera parte se estudia la simulación de eventos discretos, sus fundamentos, aspectos metodológicos generales y un buen número de aplicaciones, casos y ejemplos; además, se exponen los elementos básicos de software específico para la simulación discreta SIMUL8. En su segunda parte se presentan otras aproximaciones para la simulación con Dinámica de Sistemas y Simulación Basada en Agentes."
    },
    {
      "codigo": "3007867",
      "nombre": "SISTEMAS OPERATIVOS",
      "creditos": 3,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [
        "3010426",
        "3006906",
        "3010435"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVO GENERAL: Ofrecer a los alumnos una descripción, lo más detallada posible, de los conceptos fundamentales, estructura y funcionamiento de los sistemas operativos de computadores. OBJETIVOS ESPECÍFICOS: - Definir qué es un sistema operativo y los servicios que debe proporcionar. - Diferenciar los elementos básicos que componen un sistema operativo, cuáles operaciones se pueden realizar con ellos y su correspondencia con los elementos básicos de un computador como el procesador, la memoria RAM y los discos. - Capacitar al alumno como usuario y como programador en el entorno del sistema."
    },
    {
      "codigo": "3010426",
      "nombre": "Teoría de lenguajes de programación",
      "creditos": 3,
      "tipologia": "Disciplinar Obligatoria",
      "prerrequisitos": [
        "3006906",
        "3010435"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Descripción y Objetivos: Este curso tiene como objetivo general el desarrollo de conocimientos, habilidades y destrezas para el diseño e implementación de lenguajes de programación."
    },
    {
      "codigo": "1000003-M",
      "nombre": "ÁLGEBRA LINEAL",
      "creditos": 4,
      "tipologia": "Fundamentación Obligatoria",
      "prerrequisitos": [
        "1000008-M"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVO Asimilar los fundamentos del Algebra Lineal, a nivel elemental, pero con la profundidad necesaria para adquirir los conocimientos y habilidades básicas (capacidad de análisis y de razonamiento lógico - deductivo) para la solución de problemas en las cuales estén involucrados los elementos matemáticos de sistemas de ecuaciones lineales, espacios vectoriales, valores y vectores propios de una matriz y diagonalización de matrices. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brinadadas, tanto por los profesores de planta como por los monitores académicos de posgrado y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
    },
    {
      "codigo": "1000004-M",
      "nombre": "CÁLCULO DIFERENCIAL",
      "creditos": 4,
      "tipologia": "Fundamentación Obligatoria",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS Estudiar los conceptos de límite y derivada para funciones de una variable real y utilizar estas ideas en la solución de problemas de optimización, trazado de curvas y razones de cambio. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brindadas, tanto por los profesores de planta como por los monitores académicos de posgrado y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
    },
    {
      "codigo": "1000005-M",
      "nombre": "CÁLCULO INTEGRAL",
      "creditos": 4,
      "tipologia": "Fundamentación Obligatoria",
      "prerrequisitos": [
        "1000004-M"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS: General: lograr la apropiación por parte del. estudiante de los conceptos fundamentales del cálculo integral de funciones de una variable real y crear habilidades que le permitan aplicar estos conocimientos en problemas propios de su disciplina y abordar de manera elemental los conceptos de sucesiones y series. Específicos: - Conocer y manejar con propiedad el concepto de integral definida de una función real de una variable real y su relación con el concepto de primitiva o antiderivada, para facilitar los cálculos. - Estudiar algunas de las diferentes aplicaciones del concepto de integral. - Adquirir destrezas en el estudio de la convergencia de sucesiones y series."
    },
    {
      "codigo": "3010651",
      "nombre": "Estadística I",
      "creditos": 3,
      "tipologia": "Fundamentación Obligatoria",
      "prerrequisitos": [
        "1000003-M",
        "1000005-M"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Objetivos: Proporcionar elementos básicos acerca de la teoría de la probabilidad, variables aleatorias y distribuciones de variables aleatorias. Lograr que el estudiante se apropie de las técnicas básicas usadas frecuentemente en el análisis de datos, estimación de parámetros, inferencia estadística y regresión lineal. Metodología: la exposición de los temas es tipo magistral, con ejemplos ilustrativos y computacionales referente a cada uno de temas comentados en clase. Usualmente se usa un paquete estadístico para presentar de manera más adecuada y resumida algunos de los temas que así lo requieren y son base para la realización de trabajos propuestos en la evaluación y en los ejemplos de clase. los profesores ponen a disposición de los estudiantes horarios de atención y asesoría para reforzar los conceptos vistos en clase. asimismo, se cuenta con la ayuda de monitores los cuales tienen como tareas la realización de talleres complementarios y asesoría a estudiantes."
    },
    {
      "codigo": "1000019-M",
      "nombre": "FÍSICA MECÁNICA",
      "creditos": 4,
      "tipologia": "Fundamentación Obligatoria",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS: Generales: - Desarrollar los conceptos fundamentales de la mecánica Newtoniana y aplicar estos a diversas situaciones típicas de la física. - Desarrollar en los estudiantes capacidad para enfrentar y resolver problemas e iniciarlos en los métodos experimentales de la física. Específicos: - Definir las magnitudes físicas fundamentales y dar una descripción matemática del movimiento de las partículas. - Estudiar el contenido fundamental de las leyes de Newton. - Presentar los conceptos de trabajo y energía con la respectiva ley de conservación de la energía mecánica. - Estudiar la relación entre la cantidad de movimiento y las fuerzas en un sistema de partículas y entre la energía cinética y los trabajos. - Estudiar el equilibrio de un cuerpo rígido e introducir su dinámica de rotación. METODOLOGÍA Y EVALUACIÓN En la semana habrán tres sesiones de a 2 horas. Una sesión corresponderá a una práctica de laboratorio; las otras dos corresponderán a clases magistrales."
    },
    {
      "codigo": "1000008-M",
      "nombre": "GEOMETRÍA VECTORIAL Y ANALÍTICA",
      "creditos": 4,
      "tipologia": "Fundamentación Obligatoria",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS: 1. Desarrollar destrezas y habilidades en el uso del álgebra vectorial de dos y tres dimensiones y sus aplicaciones a otras ramas de la matemática. Proporcionar los elementos básicos de la teoría de matrices y de la solución de sistemas de ecuaciones lineales. 2. Dibujar e interpretar gráficas de lugares geométricos en el plano y en el espacio. 3. Proporcionar al estudiante los conocimientos básicos para el futuro aprendizaje del cálculo, la física y el álgebra lineal."
    },
    {
      "codigo": "3006906",
      "nombre": "MATEMÁTICAS DISCRETAS",
      "creditos": 4,
      "tipologia": "Fundamentación Obligatoria",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Objetivos generales: 1. Motivar al estudiante para que se familiarice con los métodos abstractos de razonamiento y de representación de la información. 2. Refinar la destreza matemática de los estudiantes, especialmente su habilidad para entender y escribir demostraciones y dividir problemas grandes en partes más manejables. 3. Mejorar el razonamiento matemático a través del estudio de estructuras discretas y análisis combinatorio y preparación de algoritmos. Objetivos específicos: 1. Introducir los primeros elementos de matemática discreta que permiten formar modelos y herramientas para analizar fenómenos del mundo real, que no pueden ser estudiados utilizando métodos del cálculo y el análisis. 2. Preparar al estudiante para la solución de problemas y prueba de algoritmos utilizando métodos que son apropiados para el uso del computador. 3. Destacar el papel de la teoría de grafos en la matemática y la informática. 4. Preparar al estudiante en métodos de demostración, entre los que se destaca la inducción matemática"
    },
    {
      "codigo": "3007848",
      "nombre": "BASE DE DATOS II",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007847",
        "3007744",
        "3010435"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "El objetivo general de la asignatura es ampliar los conocimientos en Bases de Datos para un mejor aprovechamiento de esta tecnología, adquiriendo destrezas y habilidades para la creación de sistemas de bases de datos de alta calidad y para la administración de una base de datos, recurso vital para cualquier organización actual. El alumno después de cursar la asignatura estará en capacidad de: - Crear procedimientos o funciones almacenadas, disparadores y otros objetos en un Sistema Gestor de Bases de Datos específico. - Diferenciar los conceptos de la orientación por objetos del Modelo Objeto-Relacional y establecer comparaciones frente al modelo relacional. - Distinguir cada una de las responsabilidades de un administrador de una base de datos y cómo llevarlas a cabo. - Diseñar y construir sistemas de bases de datos en la Web."
    },
    {
      "codigo": "3010836",
      "nombre": "Cátedra de sistemas: una visión histórico-cultural de la computación",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007741"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "Es posible definir la informática, también llamada computación, como el campo de estudio que abarca el conjunto de conocimientos, métodos y técnicas referentes al tratamiento automático de la información, junto con sus teorías y aplicaciones prácticas, con el fin de almacenar, procesar y transmitir información en formato digital utilizando sistemas computacionales. En este sentido, los sistemas de computación permiten implementar algoritmos, cumpliendo tres tareas básicas: recibir la información (entrada), procesarla y entregar los resultados (salida). En esta cátedra se consideran aspectos de la computación relacionados con sus principios, su historia (desde el primer ábaco sumerio; pasando por el desarrollo de autómatas y posteriormente procesadores; luego, la digitalización de la información y el desarrollo de software; el aporte de las mujeres y la diversidad de género en la computación; finalmente, avances recientes sobre la manera en que las máquinas aprenden; y desarrollos futuros como la computación cuántica). Además, se exploran aplicaciones en áreas fundamentales para el desarrollo científico y tecnológico del país y el mundo, es decir, aplicaciones de computación en finanzas, salud, electricidad, agro y manufactura, entre otras. Objetivo: Presentar a los estudiantes en el marco de un diálogo dinámico y didáctico, los aspectos generales, históricos y avances recientes relacionados con el estudio de elementos histórico-culturales de la computación."
    },
    {
      "codigo": "3011169",
      "nombre": "Cátedra Industria TI",
      "creditos": 2,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007741"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "En esta cátedra se analiza una amplia gama de temas relacionados con la planificación, desarrollo, implementación y gestión de sistemas y servicios de Tecnología de la Información (TI). Para su desarrollo en cada sesión habrá una discusión a partir de la exposición de una temática bien sea mediante charlas donde algunas de ellas tendrán invitados de la industria, o bien sea mediante la exposición de documentales, artículos científicos u otros medios."
    },
    {
      "codigo": "3011170",
      "nombre": "Cátedra Lovelace-Turing",
      "creditos": 2,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007741"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "En esta cátedra se analizarán múltiples aspectos relacionados a la computación, desde sus origines, pasando por personajes históricos, hasta temas de actualidad como son las tendencias tecnológicas con sus desafíos, la brecha de género, la privacidad de la información, entre otras. Para su desarrollo en casa sesión habrá una discusión a partir de la exposición de una temática que podrá tener diversos formatos: charla, libro, película, documental, serie, anime, podcast, u otro."
    },
    {
      "codigo": "3011167",
      "nombre": "Ciberseguridad",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007847",
        "3007595"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "La ciberseguridad se refiere a un conjunto de prácticas, tecnologías y medidas diseñadas para proteger los sistemas informáticos, las redes, los dispositivos y los datos de ataques, daños o accesos no autorizados. El objetivo principal de la ciberseguridad es garantizar la confidencialidad, integridad y disponibilidad de la información y los recursos digitales en un entorno cada vez más interconectado y propenso a amenazas. Esta asignatura incluye tanto teoría como práctica, con ejercicios de laboratorio, simulaciones y proyectos prácticos para que los estudiantes puedan aplicar los conocimientos adquiridos."
    },
    {
      "codigo": "3010757",
      "nombre": "Aplicaciones móviles",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007847",
        "3007865"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "El curso de Introducción a las ciencias de la computación y aplicaciones móviles se enfoca en integrar en el estudiante: la comprensión amplia y robusta de la informática y la programación; cómo pensar algorítmicamente y resolver problemas de programación de manera eficiente; conceptos como abstracción, gestión de recursos, seguridad, ingeniería de software y bajo la perspectiva del desarrollo de aplicaciones móviles. Además, a través de proyectos prácticos, ganará experiencia en el desarrollo de aplicaciones móviles y sus paradigmas, arquitectura de aplicaciones e interfaces de usuario. El curso culmina en un proyecto final para el cual implementará una aplicación para resolver un problema específico."
    },
    {
      "codigo": "3011093",
      "nombre": "Computación paralela",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007741",
        "3007847"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "En este curso se presentan los fundamentos de la computación en paralelo. Se presenta una introducción al tema y un conjunto de algoritmos convencionales para ilustrar el paralelismo, inicialmente, mediante algoritmos (pseudo-código). Se presenta posteriormente algún lenguaje de programación para implementar estos algoritmos. Luego, se presenta la aplicación del paralelismo mediante alguna herramienta o lenguaje de programación a un nivel más alto, es decir, mediante herramientas o lenguajes que ofrecen facilidades tales como funciones (o bibliotecas) preconstruidas que explotan el paralelismo. Objetivos: 1. Presentar los fundamentos de la computación en paralelo. 2. Presentar algoritmos donde se aplica programación en paralelo. 3. Presentar un lenguaje de programación que soporte paralelismo para implementar los algoritmos presentados. 4. Presentar una herramienta o lenguaje de programación que ofrezca funcionalidades de alto nivel para explotar el paralelismo."
    },
    {
      "codigo": "3010585",
      "nombre": "Creación de videojuegos",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007744"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "El curso pretende enseñar los procesos de conceptualizacion, diseño y desarrollo de videojuegos desde la concepción de la idea inicial, hasta la culminación del producto final. Se abordan, de manera conjunta, los aspectos claves de los videojuegos como el tecnico, visual, musical y de jugabilidad."
    },
    {
      "codigo": "3011018",
      "nombre": "Creación multimedia",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007744"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "En esta asignatura, el/la estudiante adquirirá competencias en la ingeniería aplicada al arte en diferentes formatos digitales."
    },
    {
      "codigo": "3011171",
      "nombre": "Desarrollo móvil",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007847"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "El desarrollo móvil se refiere al proceso de crear software específicamente diseñado para dispositivos móviles, como teléfonos inteligentes y tabletas. Estas aplicaciones móviles pueden ejecutarse en sistemas operativos específicos, como Android e iOS, y se desarrollan utilizando diferentes lenguajes de programación y tecnologías. Este tipo de desarrollos ha experimentado un crecimiento significativo en las últimas décadas debido a la creciente popularidad y uso generalizado de estos dispositivos en la vida cotidiana. Estas aplicaciones móviles pueden variar desde simples juegos y aplicaciones de entretenimiento hasta aplicaciones empresariales complejas y utilidades prácticas. En esta asignatura, además de las clases teóricas, se abordan ejercicios prácticos, proyectos individuales y en equipo, y la posibilidad de desarrollar y publicar aplicaciones móviles reales."
    },
    {
      "codigo": "3011019",
      "nombre": "Desarrollo web I (LA MEJOR)",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007847",
        "3007865"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "En esta asignatura, el/la estudiante aplicará sus conocimientos en programación y desarrollo de software en general para construir un desarrollo para la web con un enfoque práctico y aplicativo. Recorrerá desde los fundamentos esenciales del protocolo HTTP, pasando por las tecnologías de frontend y backend, para terminar con un conocimiento esencial en la construcción de aplicaciones web fullstack."
    },
    {
      "codigo": "3011172",
      "nombre": "Desarrollo web II",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3011171"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "En esta asignatura, el/la estudiante llevará a cabo un estudio profundo de las tecnologías y prácticas utilizadas en el diseño y desarrollo de aplicaciones web modernas. Centrándose específicamente en el uso de frameworks, busca proporcionar a los estudiantes las habilidades y el conocimiento necesarios para construir aplicaciones web robustas, escalables y eficientes."
    },
    {
      "codigo": "3007311",
      "nombre": "DINAMICA DE SISTEMAS",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007325",
        "1000003-M"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Objetivo: Capacitar al estudiante en el análisis de la estructura y el comportamiento de sistemas mediante el uso de herramientas blandas de la investigación de operaciones, específicamente de la dinámica de sistemas. Objetivos Específicos: Objetivos Específicos: - Desarrollar en el estudiante la capacidad de reconocer los fenómenos de retroalimentación en los procesos de decisión -acción -sistema. - Permitir al estudiante el uso de herramientas para el modelaje de sistemas complejos, altamente caóticos y no-lineales. - Capacitar al estudiante en el uso d software específico para el estudio de problemas de la dinámica de sistemas. Metodología: - Exposiciones magistrales, lecturas y tareas en grupo. Análisis de casos."
    },
    {
      "codigo": "3011173",
      "nombre": "Diseño de experiencia de usuario",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007852"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "El objetivo del curso es conocer y aplicar el proceso de diseño de productos de software centrado en el usuario: definir, empatizar, idear (plantear soluciones), prototipar y evaluar de manera iterativa haciendo énfasis en la importancia del atributo de calidad accesibilidad. Se realiza un recorrido por las diferentes fases del proceso de diseño centrado en el usuario presentando técnicas para abordar cada una de ellas. Al finalizar el estudiante estará en capacidad de diseñar productos de software centrados en los usuarios potenciales teniendo en cuenta buenas prácticas de accesibilidad."
    },
    {
      "codigo": "3007850",
      "nombre": "DISEÑO Y CONSTRUCCIÓN DE PRODUCTOS DE SOFTWARE",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007852",
        "3007853"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "Objetivo General: Practicar los conocimientos adquiridos en las asignaturas previas en la elaboración de las fases de diseño y construcción de un Sistema Informático consistente con los resultados de las fases de definición y análisis. Objetivos Específicos: - Precisar las dimensiones requeridas para seleccionar el lenguaje y el manejador de bases de datos requerido por la aplicación. - Transformar de manera consistente las especificaciones logradas en las fases previas en un diseño arquitectónico que facilite la construcción de la versión alfa de la aplicación. - Construir la versión alfa de la aplicación, complementando la documentación técnica necesaria para garantizar el mantenimiento futuro de la misma. METODOLOGÍA Y EVALUACIÓN Clases Magistrales. Elaboración de un Trabajo Práctico por entregas. Foros de Discusión."
    },
    {
      "codigo": "3007202",
      "nombre": "FUNDAMENTOS DE ECONOMÍA",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "1000003-M"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVO GENERAL: Familiarizar al estudiante con las teorías, discusiones y problemas más relevantes de la economía. Se pretende brindar al estudiante las herramientas analíticas necesarias para el entendimiento de la realidad económica actual; fomentar la capacidad de argumentación sólida tanto verbal como escrita, a partir de la lectura crítica de los textos sugeridos. De igual forma, se pretende que el estudiante al terminar el curso esté en capacidad de analizar con mayor rigor los hechos económicos relevantes. OBJETIVOS ESPECÍFICOS: - Manifestar interés y curiosidad por conocer los grandes problemas económicos actuales y analizarlos con sentido académico y crítico. - Relacionar hechos económicos significativos con el contexto social, político y cultural en que ocurren. - Conocer el funcionamiento del mercado, así como sus límites y fallos, formulando un juicio crítico del sistema. Estudiar cómo repercute la actividad económica en el medio ambiente y la calidad de vida de las personas. - Conocer y comprender los rasgos característicos de la situación y perspectiva de la economía nacional, analizando su posición en el contexto económico internacional. - Interpretar la información y datos que aparecen en los diversos medios de comunicación sobre desajustes económicos de la actualidad y analizar las medidas económicas que se proponen para remediarlos. METODOLOGÍA: Clase magistral."
    },
    {
      "codigo": "3010524",
      "nombre": "Fundamentos de mercadeo",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007202"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS GENERALES : 1) Entregar al estudiante del pregrado las herramientas fundamentales para ejercitar el pensamiento estratégico en gestión de mercadeo. 2) Desarrollar, administrar y controlar el mercado desde el punto de vista de las comunicacion. PRÁCTICA: visitas técnicas y empresariales y prácticas de laboratorio en la ciudad de Medellín, o fuera de la ciudad o en los Municipios del departamento de Antioquia o fuera del departamento de Antioquia las cuales estarán supeditadas al cumplimiento de los requerimientos definidos por la Universidad Nacional de Colombia. Tendrá una duración máxima de una (1) semana."
    },
    {
      "codigo": "3011166",
      "nombre": "Fundamentos de sistemas de información e inteligencia de negocios",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007847",
        "3007325"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "La asignatura permite al estudiante reconocer los conceptos básicos sobre sistemas de información en las organizaciones, así como manejar herramientas computacionales para realizar inteligencia de negocios a nivel exploratorio y descriptivo, incluyendo elementos de extracción, limpieza y visualización de datos con herramientas como Power BI, Tableu o Google Data Studio, para problemas organizacionales."
    },
    {
      "codigo": "3007851",
      "nombre": "GESTIÓN DE PROYECTOS DE SOFTWARE",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007852",
        "3007853"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS Objetivo General: Reconocer los elementos fundamentales que posibilitan la adecuada gestión de proyectos de Software, incluyendo la estimación, planeación, seguimiento y control del riesgo. Objetivos Específicos: - Desarrollar habilidades para realizar la estimación de las tareas en el desarrollo de una aplicación de software. - Comprender los elementos que subyacen a la planeación temporal y de recursos de los proyectos. - Incorporar estrategias para realizar el seguimiento de las tareas sobre una planeación dada, considerando los factores de riesgo que pueden afectar el adecuado desarrollo de la aplicación. METODOLOGÍA Y EVALUACIÓN Clases Magistrales. Elaboración de un Trabajo Práctico por entregas. Evaluaciones. Foros de Discusión. Estudio de Casos."
    },
    {
      "codigo": "3010500",
      "nombre": "Gestión del talento humano",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3010425"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVO: contribuir al desarrollo de competencias en los Ingenieros para participar en la gestión estratégica del talento humano en las organizaciones, en los nuevos contextos de globalización y competencia. PRÁCTICA: visitas técnicas y empresariales y prácticas de laboratorio en la ciudad de Medellín, o fuera de la ciudad o en los Municipios del departamento de Antioquia o fuera del departamento de Antioquia las cuales estarán supeditadas al cumplimiento de los requerimientos definidos por la Universidad Nacional de Colombia. Tendrá una duración máxima de una (1) semana."
    },
    {
      "codigo": "3011174",
      "nombre": "Integración y despliegue de software",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007853",
        "3007851"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "El objetivo del curso es promover en los estudiantes el desarrollo de productos de software con altos niveles de calidad mediante la incorporación de procesos de integración y entrega continua y estrategias de automatización de pruebas. Esto les permitirá a los equipos de desarrollo de software garantizar la correcta evolución de los productos de software y un adecuado despliegue de los artefactos que los componen, buscando la continuidad del negocio y operación de las organizaciones cliente."
    },
    {
      "codigo": "3009151",
      "nombre": "Introducción a la Robótica",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007741",
        "1000007-M"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVO GENERAL: este curso introducirá a los estudiantes a los fundamentos, tecnologías y los algoritmos de la robótica. El trabajo se centrará en aspectos computacionales de robots móviles de ruedas. Los temas más importantes será la movilidad, la percepción, y la navegación. Los trabajos durante el curso requerirán de la aplicación de los controladores para los kits de LEGO Mindstorms NXT robot. OBJETIVOS ESPECÍFICOS: (1) Presentar tanto los elementos conceptuales como ejemplos y aplicaciones de la robótica. (2) Introducir los tópicos relacionados con la robótica independiente al tipo de aplicación del mismo, haciendo énfasis en los aspectos conceptuales y en los aspectos teóricos de los mismos. (3) Usar un enfoque teórico-práctico, en el contexto de los diferentes fundamentos de la robótica, a través de ejemplos y cumplimiento de objetivos de trabajo. (se trabajarán en particular el uso de elementos de los kits de LEGO Mindstorms NXT robot al igual que elementos electrónicos propios relacionados con los componentes de un robot básico)."
    },
    {
      "codigo": "3007323",
      "nombre": "INVESTIGACIÓN DE MERCADOS",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3010524",
        "3006927"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS - Estudiar la investigación de mercadeo como una herramienta de información gerencial dentro del proceso de la toma de decisiones. - Profundizar en las técnicas y procedimientos usados actualmente por los investigadores. - Abordar el estudio de la investigación de mercadeo desde el punto de vista teorico-práctico, buscando un acercamiento a la realidad colombiana. - Presentar la investigación de mercadeo como un subconjunto de la investigación social. - Justificar la aplicación de la metodología científica al campo del mercadeo. - Analizar el uso de diferentes técnicas y modelos en procesos de investigación. - Revisar diversas experiencias de investigación de mercadeo en el medio colombiano. - Sustentar la necesidad de hacer investigación de mercadeo como fuene de información dentro del plan de mercadeo. - Formar al ingeniero administrador como investigador potencial - Entrenar al ingeniero administrador como un usuario de la investigación de mercadeo. - Lograr que el estudiante, al finalziar el curso, entregue una complta investigación de mercadeo sobre un aspecto de la ralidad regional. METODOLOGÍA Y EVALUACIÓN - Dado que el nivel en el cual se dicta el curso (último semestre), se define como premisa la necesidad de que los participanes ene l mismo, hagan una lectura previa de los temas que serán tratados en las sesiones de trabajo. - A diferencia de los cursos tradicionales, muchas clases se basarán más en un trabajo de grupo que en una exposición magistral por parte del docente. - Algunos temas seleccionados del programa serán complementados por expositores externos, vinculados a la realidad empresarial. - Como complemento de la teoría estudiada, se empleará el método de los casos buscando un acercamiento de la teoría con la realidad. - La mayoría de los casos serán adaptados al medio colombiano, tanto en su ubicación como en su lenguaje."
    },
    {
      "codigo": "3007325",
      "nombre": "INVESTIGACIÓN DE OPERACIONES II",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007324",
        "3006927"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS - Proporcionar herramientas avanzadas en Investigación de Operaciones tales como: cadenas de Markov, Teorías de colas, toma de decisiones e inventarios para la optimización de diseños de procesos productivos y administrativos."
    },
    {
      "codigo": "3011175",
      "nombre": "Optimización heurística",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007325",
        "3007741"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Este curso brinda las herramientas conceptuales, algorítmicas y computacionales para hallar soluciones satisfactorias (no necesariamente óptimas) a problemas de optimización que, por su naturaleza combinatoria, no convexa, de gran tamaño o no bien definida, no pueden ser resueltos en un tiempo computacional aceptable por los métodos matemáticos y de investigación de operaciones tradicionales."
    },
    {
      "codigo": "3011176",
      "nombre": "Procesamiento de lenguaje natural",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007741",
        "3009150"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "El curso aborda la representación del lenguaje humano como un sistema computacional para ser empleado en tareas como la extracción de información, traducción, o el desarrollo de agentes conversacionales (chatBots). El campo del procesamiento de lenguaje natural (NPL, por sus siglas en inglés) o Computación Lingüística integra áreas como el aprendizaje de maquina (aprendizajes supervisados y redes neuronales) con la lingüística (sintaxis, semántica). El curso revisa diferentes modelos de lenguaje (probabilísticos, N-gram, neuronales), el análisis de sintaxis y semántico, así como aplicaciones del NPL (extracción de información, traducción, y una introducción a agentes conversacionales). El curso esta dirigido a estudiantes de pregrado o posgrado que dominen un lenguaje de programación de alto nivel, tengan conocimientos previos en teorías de lenguaje de programación (expresiones regulares), y conocimientos básicos de aprendizaje supervisado y redes neuronales."
    },
    {
      "codigo": "3007871",
      "nombre": "PROGRAMACIÓN MATEMÁTICA",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007325",
        "1000006-M"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "Objetivo: Entender la programación no lineal como marco de referencia de problemas de optimización, identificar las aplicaciones típicas, y comprender los fundamentos teóricos de los diferentes algoritmos para aplicar el algoritmo adecuado al problema bajo estudio. Incluye algoritmos clásicos de optimización y metaheuristicas. Objetivos Específicos: - Hacer una revisión de la programación lineal, sus métodos de resolución y sus más importantes aplicaciones. - Introducir al alumno en la programación no lineal, sus métodos de resolución y sus aplicaciones. - Introducir los dos modelos más generales de programación no lineal: el restringido y el no restringido. En ambos casos, estudiar las condiciones de optimalidad y algunos procedimientos de resolución. - Que el alumno aprenda a formular y resolver problemas reales mediante modelos matemáticos en el contexto de la programación matemática. - Que el alumno aprenda a manejar algunos softwares comerciales para la programación matemática. Metodología: El curso tiene un carácter aplicado, prestando especial atención a los métodos y algoritmos de resolución. En simultánea con la teoría se estudiarán múltiples ejemplos prácticos, con énfasis en problemas reales y de gran complejidad. El curso se realizará mediante exposiciones magistrales con ayudas audiovisuales: Se entregará copias de las clases y difusión de información vía Internet. Realización de 2 parciales y 3 trabajos usando softwares comerciales."
    },
    {
      "codigo": "3011021",
      "nombre": "Programación para ingeniería",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007741"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "En esta asignatura, el/la estudiante ampliará sus conocimientos en programación en temas como manejo de arreglos multidimensionales, graficación y análisis de datos."
    },
    {
      "codigo": "3009150",
      "nombre": "Redes Neuronales Artificiales y Algoritmos Bio-Inspirados",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007741",
        "1000006-M"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Presentar el paradigma de los sistemas conexionistas y los conceptos básicos necesarios para realizar aplicaciones exitosas de esta herramienta a problemas reales. El estudiante adquirirá el conocimiento suficiente para: lograr un entendimiento adecuado del paradigma, de tal forma que alcance una visión global que enmarque los tópicos objeto del curso y los conocimientos ya adquiridos en otras materias; identificar los aspectos fundamentales que deben considerarse para solucionar exitosamente un problema usando esta herramienta que le brinda la Inteligencia Artificial; lograr un entendimiento adecuado del proceso de desarrollo de soluciones computarizadas usando las herramientas presentadas; realizar una evaluación e integración efectivas de las consideraciones cuantitativas y cualitativas de las distintas herramientas. El estudiante dispondrá de las destrezas, habilidades y la experiencia suficiente para: analizar problemas relativamente complejos y determinar si es posible usar las herramientas presentadas como técnicas de solución; identificar los aspectos claves para realizar una solución exitosa; determinar los requerimientos de información para la solución de los problemas; usar adecuadamente las distintas metodologías presentadas; desarrollar prototipos de sistemas para la solución de problemas."
    },
    {
      "codigo": "3007595",
      "nombre": "REDES TELEINFORMATICAS I",
      "creditos": 4,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007847"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Este curso introduce la arquitectura, funciones, componentes y modelos de Internet y otras redes de computadores. Utiliza los modelos por capas OSI y TCP para examinar la naturaleza y roles de protocolos y servicios en las capas de aplicación, red, enlace de datos y física. Los principios y estructura del direccionamiento IP y las bases de conceptos, medios y operaciones de Ethernet son dados como base del curso. Los laboratorios utilizan un modelo Internet para analizar datos reales sin afectar el desempeño de la red. Actividades en el software Packet Tracer ayudan a analizar la operación de la red y de diferentes protocolos, además de construir pequeños ambientes simulados de redes. Al final del curso, los estudiantes construyen simples topologías LAN aplicando los conceptos básicos de cableado, realizando configuraciones básicas en dispositivos como switches y routers, así como la implementación de esquemas de direccionamiento."
    },
    {
      "codigo": "3007596",
      "nombre": "REDES TELEINFORMATICAS II",
      "creditos": 4,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007595"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Este curso describe la arquitectura, componentes y operación de enrutadores, y explica los principios de enrutamiento y los protocolos asociados. Los estudiantes analizan, configuran, verifican y soluciona problemas con los principales protocolos de enrutamiento RIPv1, RIPv2, EIGRP y OSPF. Al finalizar el curso, los estudiantes estará capacitados para reconocer problemas acerca de enrutamiento. Cada capítulo encamina a los estudiantes a través de laboratorios que presentan configuraciones, implementaciones y solución de problemas. Las actividades realizadas en el software Packet Tracer refuerzan los conceptos vistos y permiten a los estudiantes los procesos de enrutamiento que pueden ser difíciles de entender."
    },
    {
      "codigo": "3007597",
      "nombre": "REDES TELEINFORMATICAS III",
      "creditos": 4,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007596"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Este curso da un acercamiento teórico-práctico para aprender las tecnologías y protocolos necesarios para diseñar e implementar una red conmutada convergente. Los estudiantes aprenderán acerca del modelo jerárquico de diseño de redes y de cómo seleccionar los dispositivos para cada capa. Este curso explica como configurar un switch para funcionalidad básica, y de cómo implementar VLAN, VTP, y enrutamiento inter-VLAN en una red convergente. Las diferentes implementaciones de STP en una red convergente son presentadas, y los estudiantes desarrollan el conocimiento y habilidades necesarias para implementar WLAN en una red a escala pequeña y mediana."
    },
    {
      "codigo": "3009936",
      "nombre": "Seguridad WEB",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3011171",
        "3007847"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "Este curso gira en torno al estudio de vulnerabilidades en aplicaciones web, cómo detectarlas, explotarlas y prevenirlas. El énfasis está en el reconocimiento de los ataques más básicos que un usuario malicioso puede hacer para romper en un sistema informático, a fin de reunir los conocimientos necesarios para codificar aplicaciones web más seguras. Este curso está dirigido a estudiantes de pregrado con conocimiento básico en desarrollo web, de bases de datos y que estén interesados en técnicas de hacking y herramientas de seguridad."
    },
    {
      "codigo": "3011034",
      "nombre": "Servicios en la nube",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007595"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "En esta asignatura, el/la estudiante aprenderá los conceptos básicos de la computación en la nube y llevará a cabo ejercicios prácticos en el contexto de los principales proveedores del mercado."
    },
    {
      "codigo": "3007860",
      "nombre": "Sistema de Recuperación de Información de Web",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007847",
        "3007741"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "El objetivo general de la asignatura es introducir al alumno en los aspectos fundamentales de la Recuperación de Información procedente de la Web y su problemática, así como proporcionar métodos y soluciones en dicho campo, haciendo énfasis en los aspectos prácticos de esta materia. El alumno después de cursar la asignatura debe: - Conocer el problema y soluciones a la recuperación de Información en documentos semiestructurados procedentes de la Web. - Conocer el uso de los lenguajes de ontologías para la descripción y consulta de recursos Web. - Entender el uso de la lógica y la inferencia en problemas de recuperación de información. - Ser capaz de aplicar las técnicas estudiadas para resolver problemas reales de interés práctico en la recuperación de información procedente de la Web."
    },
    {
      "codigo": "3007872",
      "nombre": "SISTEMAS COMPLEJOS",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "1000007-M",
        "3007741"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "OBJETIVOS Desarrollar habilidades para analizar los comportamientos de los sistemas a partir de la intuición y a partir de herramientas matemáticas cualitativas bajo condiciones variables y de no linealidad. PROGRAMA RESUMIDO Qué es complejidad. Algunos conceptos relacionados con la complejidad. Complejidad en la naturaleza. Aproximación al modelamiento de la complejidad. Algunas suposiciones y sus efectos. Análisis cualitatitivo y análisis de estabilidad de sistemas de ecuaciones diferenciales. Atractores y caos. Análisis de bifurcaciones y escalas de tiempo. Fractales. Algunos conceptos relacionados. Medidas y Dimensiones. Multifractales en la práctica. Fractales en los sistemas aleatorios. Autómatas celulares. Presentación e historia. Definiciones relacionadas. Aspectos teóricos, computación y dinámica de un autómata celular. Aplicaciones. Simulación basada en Agentes. Definición. Propiedades de los agentes. Técnicas de programación. Comparación entre la simulación basada en ecuaciones frente a simulación basada en agentes. Ejemplos y aplicaciones."
    },
    {
      "codigo": "3007854",
      "nombre": "TÉCNICAS EN APRENDIZAJE ESTADÍSTICO",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3009150",
        "3006927"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "Al terminar el curso, el estudiante estará en capacidad de desarrollar soluciones basadas en redes neuronales, sistemas difusos, metaheuristicas y aprendizaje estadistico a problemas de mediana complejidad. Igualmente podrá diseñar, implementar y validar"
    },
    {
      "codigo": "3010425",
      "nombre": "Teoría administrativa y organizacional",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007202"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS CENTRALES DEL CURSO : 1) Reflexionar sobre elementos asociados al concepto de organización social, a su estructura y su dinámica tanto interna como externa. 2) Estudiar la evolución de la teoría general de la administración . 3) Realizar un acercamiento a la noción de proceso administrativo . La metodología que se propone incluye las siguientes actividades : 1) Actividades con énfasis en la elaboración y manejo significativo de los conceptos . 2) Lectura y discusión de textos propuestos . 3) Exposición del profesor y los participantes . 4) Análisis crítico sobre los conceptos organización y sus principios, la teoría general de la administración y el proceso administrativo, todos relacionados con el contenido del curso . 5) Actividades de aplicación a la práctica del profesional . 6) Elaboración de un trabajo práctico en organizaciones, aplicando los contenidos tratados durante el curso. 7) Actividades de auto evaluación (reflexión personal sobre la planeación y desarrollo de las actividades; evaluación de los logros individuales). PRACTICA: visitas técnicas y empresariales y prácticas de laboratorio en la ciudad de Medellín, o fuera de la ciudad o en los Municipios del departamento de Antioquia o fuera del departamento de Antioquia las cuales estarán supeditadas al cumplimiento de los requerimientos definidos por la Universidad Nacional de Colombia. Tendrá una duración máxima de una (1) semana."
    },
    {
      "codigo": "3007873",
      "nombre": "TEORÍA DE LA ORGANIZACIÓN INDUSTRIAL",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007202",
        "3007325"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "El objetivo general de esta asignatura es familiarizar a los estudiantes con los conceptos básicos de la economía de las firmas y las organizaciones industriales. El alumno después de cursar la asignatura debe: - Comprender los conceptos básicos de la microeconomía y la teoría de juegos. - Comprender de qué depende la estructura de las industrias. - Comprender cómo es la competencia estratégica de las firmas en mercados no competitivos."
    },
    {
      "codigo": "3007862",
      "nombre": "VISIÓN ARTIFICIAL",
      "creditos": 3,
      "tipologia": "Disciplinar Optativa",
      "prerrequisitos": [
        "3007741",
        "1000006-M"
      ],
      "correrquisitos": [],
      "disponible": false,
      "descripcion": "El objetivo general de la asignatura es introducir al alumno en los aspectos fundamentales de la Visión Artificial y su problemática, así como proporcionar métodos y soluciones en dicho campo, haciendo énfasis en los aspectos prácticos de esta materia. El alumno después de cursar la asignatura debe: - Conocer las etapas de un sistema de visión artificial (SVA). - Entender la problemática y estudiar las técnicas fundamentales de las diferentes etapas (preprocesamiento, segmentación, extracción de características y reconocimiento), seguidas del análisis automático de imágenes digitales. - Ser capaz de aplicar las técnicas estudiadas para resolver problemas reales de interés práctico en visión artificial."
    },
    {
      "codigo": "1000009-M",
      "nombre": "BIOLOGÍA GENERAL",
      "creditos": 3,
      "tipologia": "Fundamentación Optativa",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "El curso tiene un enfoque teórico práctico, que ofrece al estudiante, una visión general y actualizada de las ciencias biológicas. La asignatura pretende contribuir en la formación de profesionales con una visión crítica de los diferentes tópicos biológicos que constituyen aspectos básicos del perfil de todo profesional en el área de ciencias biológicas aplicadas. El programa comprende clases magistrales (análisis, síntesis y evaluación de conceptos) y prácticas de laboratorio (individuales y en grupos, que permiten correlacionar y analizar las principales estructuras y fenómenos celulares en diversas clases de organismos)."
    },
    {
      "codigo": "1000006-M",
      "nombre": "CÁLCULO EN VARIAS VARIABLES",
      "creditos": 4,
      "tipologia": "Fundamentación Optativa",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS: - Estudiar los conceptos fundamentales del cálculo de funciones de varias variables (límites, continuidad, diferenciación e integración) y los teoremas centrales del Cálculo vectorial (Teoremas de Green, Gauss y Stokes). - Estimular y desarrollar la capacidad de análisis y de razonamiento lógico-deductivo del estudiante. - Capacitar al estudiante para la interpretación, formulación y solución de problemas en las áreas relacionadas con su especialidad en las cuales se haga necesario la aplicación del cálculo de funciones de varias variables y del cálculo vectorial."
    },
    {
      "codigo": "1000007-M",
      "nombre": "ECUACIONES DIFERENCIALES",
      "creditos": 4,
      "tipologia": "Fundamentación Optativa",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS: -Modelar por medio de ecuaciones diferenciales algunos sistemas simples y predecir su comportamiento. -Comprender y utilizar las diferentes técnicas analíticas y cualitativas para resolver ecuaciones diferenciales. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brindadas, tanto por los profesores de planta como por los monitores académicos de posgrado y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
    },
    {
      "codigo": "3006927",
      "nombre": "ESTADÍSTICA DESCRIPTIVA Y EXPLORATORIA",
      "creditos": 4,
      "tipologia": "Fundamentación Optativa",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "objetivos. conocer y profundizar en las distintas técnicas de análisis exploratorio de datos, métodos para la recolección de datos, técnicas formales de inferencia estadística y técnicas de regresión y análisis de varianza. A traves de ejemplos reales de distintas disciplinas tales como Economía, Ciencias de la Salud, Ciencias Sociales y Biología entre otras, se exploran formas adecuadas para mirar y analizar datos."
    },
    {
      "codigo": "3006915",
      "nombre": "ESTADÍSTICA II",
      "creditos": 4,
      "tipologia": "Fundamentación Optativa",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "El curso de Estadística II tiene como objetivo general, conocer y profundizar en los fundamentos básicos, propiedades y aplicaciones de los modelos de regresión lineal y de los elementos del muestreo. El curso tendrá una orientación teórico-práctica, sin mucho rigor matemático."
    },
    {
      "codigo": "3009137",
      "nombre": "Estadística III",
      "creditos": 4,
      "tipologia": "Fundamentación Optativa",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "El objetivo general es proporcionar los elementos básicos de la teoría de series de tiempo univariadas, lineales y no lineales, e introducir el manejo de software para implementarla, con énfasis en el cálculo de pronósticos y aplicaciones. Programa Resumido: - Introducción al lenguaje R.- Filtros y descomposición por LOESS - Modelos de regresión para la tendencia - Modelado de la estacionalidad -Caracterización y modelación de ciclos: Modelos MA, AR, ARMA. Resumen: modelo de pronóstico con componentes de tendencia, estacionalidad y ciclos. - Tendencia estocástica: Modelos ARIMA. - Modelos SARIMA. Evaluación: trabajos y/o exámenes escritos."
    },
    {
      "codigo": "1000017-M",
      "nombre": "FÍSICA DE ELECTRICIDAD Y MAGNETISMO",
      "creditos": 4,
      "tipologia": "Fundamentación Optativa",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS Generales - Describir aquellos fenómenos físicos que involucren los conceptos de campo y potencial gravitacionales, eléctricos y magnéticos. - Aplicar los conceptos de campo y potencial a casos gravitacionales, eléctricos y magnéticos elementales. Específicos - Calcular campos y/o potenciales eléctricos y gravitacionales de configuraciones elementales. - Calcular campos magnéticos estáticos de configuraciones elementales. - Analizar circuitos resistivos y capacitivos de corriente directa. - Calcular la fuerza electromotriz inducida en situaciones electromagnéticas simples. - Sintetizar las leyes de Maxwell en forma diferencial. METODOLOGÍA Y EVALUACIÓN En la semana habrán tres sesiones de a 2 horas. Una sesión corresponderá a una práctica de laboratorio; las otras dos corresponderán a clases magistrales."
    },
    {
      "codigo": "1000020-M",
      "nombre": "FÍSICA DE OSCILACIONES, ONDAS Y ÓPTICA",
      "creditos": 4,
      "tipologia": "Fundamentación Optativa",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS Generales - Familiarizar al estudiante con los fenómenos ondulatorios. - Construir un cuerpo teórico coherente que permita explicar los fenómenos ópticos. Espeíficos: - Analizar los fundamentos del movimiento oscilatorio. - Generalizar el comportamiento de las ondas mecánicas. - Describir el comportamiento de las ondas electromagnéticas. - Desarrollar los dos modelos clásicos de la luz: teoría de rayos y teoría ondulatoria. METODOLOGÍA Y EVALUACIÓN En la semana habrán tres sesiones de a 2 horas. Una sesión corresponderá a una práctica de laboratorio; las otras dos corresponderán a clases magistrales. Se realizarán cuatro parciales de 20 % cada uno; la actividad realizada en el laboratorio tendrá un valor del 20%."
    },
    {
      "codigo": "3010334",
      "nombre": "Fundamentos de matemáticas",
      "creditos": 4,
      "tipologia": "Fundamentación Optativa",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Los objetivos principales de este curso son dos: 1. Motivar al estudiante para que se familiarice con los métodos abstractos de razonamiento y de representación de la información. 2. Desarrollar las destrezas matemáticas necesarias para entender y hacer pruebas. Objetivos específicos: Aprender los conceptos básicos de lógica, métodos de prueba, teoría de conjuntos, funciones y relaciones. Es prerrequisito de los cursos de Fundamentos de Matemática Discreta y Fundamentos de Análisis. Nota: Se presenta un programa detallado basado en el libro guía de Epp [Ep] y se sugiere complementarlo con el texto de Bloch. [Bl]. El objetivo es mezclar las dos visiones que presentan estos textos. En particular, al inicio del curso utilizar la metodología de Epp, quien introduce los enteros muy temprano en el curso y de una forma intuitiva, con el fin de hacer las primeras pruebas en el contexto de la teoría de números."
    },
    {
      "codigo": "3010391",
      "nombre": "Geometría Aplicada",
      "creditos": 4,
      "tipologia": "Fundamentación Optativa",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Se dan las bases de geometría vectorial, afín, euclidiana, proyectiva y diferencial necesarias para aplicaciones en áreas relacionadas con imágenes cómo diseño geométrico asistido por computadora, informática gráfica, realidad aumentada, video juegos, animación etc."
    },
    {
      "codigo": "3006931",
      "nombre": "INTRODUCCIÓN AL MANEJO DE DATOS ESTADÍSTICOS",
      "creditos": 4,
      "tipologia": "Fundamentación Optativa",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Este curso esta diseñado para los estudiantes de primer semetre de la carrera de estadística para que adquieran un panorama general de los tópicos fundamentales de la estadística y para estimular el pensamiento estadístico. Objetivos: 1. Explorar de manera intuitiva los principales tópicos en estadística. 2. Manejar el vocabulario esencial en el contexto estadístico. 3. Realizar trabajos sencillos de experimentación en el contexto de la rigurosidad estadística. 4. Reconocer el uso apropiado de la estadística en contextos reales y distinguirlo del abuso que se puede hacer de la estadística."
    },
    {
      "codigo": "3006825",
      "nombre": "Laboratorio de química general",
      "creditos": 2,
      "tipologia": "Fundamentación Optativa",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS: Enfatizar determinados conceptos químicos para lo cual se implementa un procedimiento sencillo y claro que les permita comprobar de forma experimental el tema de estudio. Promover un mejor conocimiento y comprensión de la Química y su tecnología, sus productos y métodos, y su importancia e impacto en el mundo actual. Desarrollar la capacidad de analizar, observar e interpretar los resultados, así como, desarrollar habilidades en ele manejo de materiales y equipos de laboratorio. METODOLOGÍA: - El profesor hará una presentación del tema (orientación) sobre la práctica a realizar. - Cada grupo de trabajo estará conformado por dos estudiantes. - La calificación del estudiante se basará: Preinforme (25%), Informe (50%), Examenes (15%) y Trabajo en el laboratorio (10%) El estudiante al llegar al laboratorio debe presentar el preinforme de la práctica a realizar y el informe de la práctica que ya ha realizado. Por lo tanto el estudiante debe leer cuidadosamente la practica que se va a realizar, aclarar dudas a tiempo, realizar el preinforme y llegar puntual al laboratorio."
    },
    {
      "codigo": "3006905",
      "nombre": "MATEMÁTICAS ESPECIALES",
      "creditos": 4,
      "tipologia": "Fundamentación Optativa",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "En esta asignatura se estudian los problemas fundamentales de la física matemática (problemas de frontera que involucran ecuaciones diferenciales parciales) con el fin de que el estudiante esté en capacidad de formular modelos matemáticos apropiados para resolver problemas relacionados con su especialidad. Se pretende también que el estudiante alcance cierta destreza en la solución de los problemas asociados a dichos modelos. Este curso se dictará siguiendo la modalidad de Clases Magistrales en la cual se combinan conferencias teóricas, talleres y asesorías individuales. El estudiante debe tener presente que cada una de estas componentes es esencial en la metodología. Por lo tanto se espera que asista una vez por semana a los talleres programados y, regularmente, a las asesorías."
    },
    {
      "codigo": "3006907",
      "nombre": "MÉTODOS NUMÉRICOS",
      "creditos": 4,
      "tipologia": "Fundamentación Optativa",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS: Conseguir una comprensión integral de los métodos numéricos que incluya los teoremas en los que se basan, la forma como se definen y como se calcula con ellos en el computador. Utilizar MATLAB como herramienta principal para la computación. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brindadas, tanto por los profesores de planta como por los monitores académicos de posgrado y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
    },
    {
      "codigo": "3006829",
      "nombre": "Química general",
      "creditos": 3,
      "tipologia": "Fundamentación Optativa",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "OBJETIVOS: 1) Adquirir conciencia de la Química como ciencia básica y soporte de diversas asignaturas profesionales, como también de numerosos procesos científicos y tecnológicos. 2) Propiciar el desarrollo de aptitudes y destrezas que permitan al estudiante explicar los fenómenos naturales con base en los principios de la química y de otras ciencias relacionadas con ella. 3) Adquirir conocimientos de la estructura atómica y molecular que permitan relacionarlos con las propiedades de la materia. METODOLOGÍA Y EVALUACIÓN: El profesor hará una presentación del tema mediante clases magistrales. La evaluación del estudiante se basará en: 1) Tres parciales de dos (2) horas cada uno, organizados por Escuela (25% c/u). 2) Pruebas cortas de seguimiento (mínimo tres quizzes) (25%)."
    },
    {
      "codigo": "3007869",
      "nombre": "CURSOS DE POSGRADO",
      "creditos": 6,
      "tipologia": "Trabajo de Grado",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Asignatura que permite al estudiante cursar materias de posgrado como parte de su formación de pregrado, contribuyendo a su preparación académica avanzada."
    },
    {
      "codigo": "3010684",
      "nombre": "Práctica de Extensión",
      "creditos": 6,
      "tipologia": "Trabajo de Grado",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Asignatura de Carácter especial en la que le estudiante fortalece, aplica, emplea y desarrolla su capacidad investigativa, su creatividad y disciplina de trabajo en el tratamiento de un problema específico, mediante la aplicación de los conocimientos y métodos adquiridos en el desarrollo del plan de estudios. Tiene como objetivo fomentar la autonomía en la realización de trabajos científicos, científico-técnicos y de creación propios de su disciplina o profesión."
    },
    {
      "codigo": "3007868",
      "nombre": "TRABAJO DE GRADO",
      "creditos": 6,
      "tipologia": "Trabajo de Grado",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Trabajo final de grado donde el estudiante demuestra su capacidad para aplicar los conocimientos adquiridos en la solución de un problema específico de su área de estudio."
    },
    {
      "codigo": "L001",
      "nombre": "HISTORIA DE COLOMBIA",
      "creditos": 3,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Estudio de los principales procesos históricos de Colombia desde la época precolombina hasta la actualidad."
    },
    {
      "codigo": "L002",
      "nombre": "FILOSOFÍA POLÍTICA",
      "creditos": 3,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Introducción a los conceptos fundamentales de la filosofía política y su aplicación en el análisis de sistemas políticos contemporáneos."
    },
    {
      "codigo": "L003",
      "nombre": "DEPORTE FORMATIVO I",
      "creditos": 1,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Práctica de actividades deportivas para el desarrollo físico y la promoción de hábitos saludables."
    },
    {
      "codigo": "L004",
      "nombre": "DEPORTE FORMATIVO II",
      "creditos": 1,
      "tipologia": "Libre Elección",
      "prerrequisitos": [
        "L003"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Continuación de la práctica deportiva con énfasis en el perfeccionamiento técnico y táctico."
    },
    {
      "codigo": "L005",
      "nombre": "ARTE Y CULTURA",
      "creditos": 2,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Exploración de diferentes manifestaciones artísticas y culturales, desarrollando la sensibilidad estética y cultural."
    },
    {
      "codigo": "L006",
      "nombre": "ECOLOGÍA BÁSICA",
      "creditos": 3,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Estudio de los ecosistemas, las relaciones entre organismos y su ambiente, y los principios de conservación ambiental."
    },
    {
      "codigo": "L007",
      "nombre": "EMPRENDIMIENTO E INNOVACIÓN",
      "creditos": 3,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Desarrollo de competencias emprendedoras y habilidades para la innovación en diferentes contextos profesionales."
    },
    {
      "codigo": "L008",
      "nombre": "ÉTICA PROFESIONAL",
      "creditos": 2,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Análisis de los principios éticos aplicados al ejercicio profesional y la responsabilidad social."
    },
    {
      "codigo": "L009",
      "nombre": "LENGUA DE SEÑAS COLOMBIANA",
      "creditos": 3,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Introducción a la lengua de señas colombiana como medio de comunicación con la comunidad sorda."
    },
    {
      "codigo": "L010",
      "nombre": "PSICOLOGÍA GENERAL",
      "creditos": 3,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Fundamentos de la psicología, procesos mentales básicos y comportamiento humano."
    },
    {
      "codigo": "L011",
      "nombre": "COMUNICACIÓN ORAL Y ESCRITA",
      "creditos": 3,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Desarrollo de competencias comunicativas en expresión oral y escrita para contextos académicos y profesionales."
    },
    {
      "codigo": "L012",
      "nombre": "FRANCÉS BÁSICO I",
      "creditos": 3,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Introducción al idioma francés con énfasis en competencias básicas de comunicación oral y escrita."
    },
    {
      "codigo": "L013",
      "nombre": "FRANCÉS BÁSICO II",
      "creditos": 3,
      "tipologia": "Libre Elección",
      "prerrequisitos": [
        "L012"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Continuación del aprendizaje del francés con desarrollo de competencias comunicativas intermedias."
    },
    {
      "codigo": "L014",
      "nombre": "ALEMÁN BÁSICO I",
      "creditos": 3,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Introducción al idioma alemán con énfasis en competencias básicas de comunicación oral y escrita."
    },
    {
      "codigo": "L015",
      "nombre": "ALEMÁN BÁSICO II",
      "creditos": 3,
      "tipologia": "Libre Elección",
      "prerrequisitos": [
        "L014"
      ],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Continuación del aprendizaje del alemán con desarrollo de competencias comunicativas intermedias."
    },
    {
      "codigo": "L016",
      "nombre": "MÚSICA Y SOCIEDAD",
      "creditos": 2,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Análisis de la música como fenómeno social y cultural, y su impacto en diferentes contextos históricos."
    },
    {
      "codigo": "L017",
      "nombre": "TEATRO Y EXPRESIÓN",
      "creditos": 2,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Desarrollo de habilidades expresivas y comunicativas a través de técnicas teatrales y dramáticas."
    },
    {
      "codigo": "L018",
      "nombre": "FOTOGRAFÍA BÁSICA",
      "creditos": 2,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Introducción a la fotografía como medio de expresión artística y documental."
    },
    {
      "codigo": "L019",
      "nombre": "SOCIOLOGÍA GENERAL",
      "creditos": 3,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Estudio de los fenómenos sociales, estructuras sociales y procesos de cambio en la sociedad contemporánea."
    },
    {
      "codigo": "L020",
      "nombre": "ANTROPOLOGÍA CULTURAL",
      "creditos": 3,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Análisis de la diversidad cultural humana y los procesos de construcción de identidades culturales."
    },
    {
      "codigo": "TEST001",
      "nombre": "PRUEBA API BACKEND",
      "creditos": 4,
      "tipologia": "Libre Elección",
      "prerrequisitos": [],
      "correrquisitos": [],
      "disponible": true,
      "descripcion": "Asignatura de prueba para verificar que el frontend consume la API del backend correctamente.",
      "avance": false,
      "avanceTipologia": "",
      "avancePorcentaje": ""
    },
    {
      "nombre": "BASE DE DATOS I",
      "codigo": "3007847",
      "creditos": "3",
      "tipologia": "Disciplinar Obligatoria",
      "descripcion": "Objetivo general: \nPresentar los conceptos básicos referentes a la teoría de bases de datos, formas de modelarlas, manipularlas y permitir la interacción con ellas mediante un sistema de gestión de bases de datos (SGBD). \n\nObjetivos específicos: \n- Modelar una base de datos tanto conceptual como lógicamente.\n- Hacer uso de un lenguaje de base de datos para la implementación y manipulación de bases de datos relacionales.\n- Construir interfaces de usuario para la interacción con un SGBD.  \n\nMetodología:\n- Clases magistrales.\n- Clases prácticas en la sala de cómputo.\n- Asesorías extra clase.\n- Desarrollo de ejercicios en clase por parte de los estudiantes y el profesor.\n- Asignación de trabajos en grupo.\n\n Evaluación: \n- Exámenes.\n- Trabajos en entregas parciales.",
      "prerrequisitos": [
        "3007741"
      ],
      "avance": false,
      "avanceTipologia": "",
      "avancePorcentaje": "",
      "id": "1753139675616"
    },
    {
      "nombre": "ESTRUCTURA DE DATOS",
      "codigo": "3007741",
      "creditos": "3",
      "tipologia": "Disciplinar Obligatoria",
      "descripcion": "OBJETIVOS:\n\n- Presentarle al estudiante los conceptos y técnicas asociadas a la definición de agregados de datos y algoritmos para su manipulación, en contexto de los lenguajes procedí mentales.\n- Agregados como concepto relativo a la óptica del observador\n- Operaciones sobre los agregados: constructores y Destructores, Cursor y Navegación, Actualización y Consulta.\n- Interfaz e implementación: El agregado como un tipo abstracto sobre el que poseen solo las operaciones.\n- Eficiencia de los algoritmos: Orden y tipicación de los algoritmos (voraces, divide y vencerás, precondicionamiento, probalísticos).\n- Estructura de datos iteradas y su efecto en las operaciones:  listas ordenadas, arboles, arboles de búsqueda, arboles +, estructuras Hash.\n\nEn el curso se presentan tanto los elementos conceptuales como ejemplos y algoritmos específicos.  Los tópicos se presentan con independencia del lenguaje de programación, haciendo énfasis en los aspectos conceptuales y en los aspectos estructurales del diseño. Para los proyectos de programación el estudiante deberá usar el lenguaje C (o C++).\n\nMetodología y Evaluación:\nSe combinarán conferencias magistrales para la presentación de los conceptos y ejemplos básicos, con una serie de talleres dirigidos, orientados a facilitarle al estudiante la elaboración de los proyectos de programación involucrados en el curso.\n\nSe propondrá una serie de proyectos de programación orientados a reforzar los conceptos presentados, que deben ser elaborados de forma individual por los estudiantes y discutidos en clases especiales para tal fin.\n\nEvaluación:\nTrabajos: 15%\nExámenes: 75%\nExámenes cortos: 10%",
      "prerrequisitos": [
        "3007744"
      ],
      "avance": false,
      "avanceTipologia": "",
      "avancePorcentaje": "",
      "id": "1753139745368"
    },
    {
      "nombre": "Estructuración y evaluación de proyectos de ingeniería",
      "codigo": "3010407",
      "creditos": "3",
      "tipologia": "Disciplinar Obligatoria",
      "descripcion": "El objetivo principal del curso, que utiliza la metodología de aprendizaje basado en proyectos, es desarrollar pensamiento crítico y habilidades para resolver problemas, analizando el entorno y desarrollando el estado del arte del tema a trabajar para plantear soluciones a problemas reales. A través del trabajo en equipo de un proyecto, se desarrolla habilidades profesionales transversales, como comunicación (escrita y oral), toma de decisiones, trabajo en equipo y gestión de proyectos. En las herramientas ambientales, financieras y económicas (AFE) se estudian casos en parejas aleatorias para el desarrollo de habilidades transversales y apropiación de conceptos, se realiza un parcial individual de herramientas financieras para evaluar conceptos. Aporta conocimientos en herramientas de estructuración y evaluación de proyectos (EEP) desde AFE con aspectos técnicos y legales, para evaluar factibilidad y viabilidad de proy. productivos. Objetivos- Identificar, caracterizar y analizar un problema u oportunidad (PO) reales. - Adquirir conocimientos avanzados de gestión y planeación de proy. de ing.- Introducir en el diseño y uso de herramientas para la (EEP) de ing. a nivel AFE. - Evaluar la viabilidad técnica, AFE de proyectos productivos. Autocoevaluación aplicada a la nota final del proyecto (50%), instrumento que permite evaluar trabajo en equipo. Las notas serán las correspondientes al integrante que menos saque. Cada nota se relaciona con trabajo en equipo.\nPRÁCTICA: el desarrollo de los temas de la asignatura podrá tener como complemento el desarrollo de prácticas extramurales, visitas técnicas, salidas de campo; en la ciudad de Medellín o en los Municipios del departamento de Antioquia; las cuales estarán supeditadas al cumplimiento de los requerimientos definidos por la Universidad Nacional de Colombia. Tendrá una duración de 1 o máximo 2 días según el alcance de la práctica (aprobado por el Consejo de la Facultad de Minas el 5 de diciembre de 2024, Acta 33).",
      "prerrequisitos": [
        "3010408"
      ],
      "avance": true,
      "avanceTipologia": "Disciplinar",
      "avancePorcentaje": "20",
      "id": "1753139922486"
    },
    {
      "nombre": "Análisis y Diseño de Algoritmos",
      "codigo": "3009430",
      "creditos": "3",
      "tipologia": "Disciplinar Optativa",
      "descripcion": "Cualquiera con una experiencia mínima en algoritmos y programación sabe que para un mismo problema pueden existir innumerables algoritmos de solución. Tales soluciones pueden variar en diversos aspectos, siendo de particular interés la eficiencia en términos de su costo computacional. En el contexto de dicha eficiencia se puede hablar de algoritmos \"mejores\" que otros, siendo el objetivo principal de esta asignatura brindarle elementos al estudiante para analizar y diseñar algoritmos eficientes.\n\nPese a su enfoque a la programación, los contenidos de la asignatura se presentan sin considerar un lenguaje específico, haciendo así énfasis en los aspectos conceptuales y estructurales de los algoritmos. Es necesario sin embargo que el estudiante no solamente conozca sino que tenga buen dominio de algún lenguaje de programación, preferiblemente Java o C++.\n\nLa metodología de la asignatura se compone de clases teóricas magistrales para la actividad presencial y ejercicios propuestos para la actividad autonoma independiente. Igualmente, la asignatura hace uso de foros de discusión en línea para compartir resultados, resolver dudas, y profundizar contenidos.\n\nLa evaluación se realiza mediante la resolución de talleres, mínimo uno por cada uno de los temas abordados exceptuando la introducción.",
      "prerrequisitos": [
        "3007741"
      ],
      "avance": false,
      "avanceTipologia": "",
      "avancePorcentaje": "",
      "id": "1753140612890"
    }
  ],
  "tipologias": {
    "Fundamentación Obligatoria": {
      "nombre": "Fundamentación Obligatoria",
      "descripcion": "Asignaturas básicas obligatorias del programa",
      "creditos_minimos": 45,
      "color": "#dc2626"
    },
    "Fundamentación Optativa": {
      "nombre": "Fundamentación Optativa",
      "descripcion": "Asignaturas básicas optativas del programa",
      "creditos_minimos": 12,
      "color": "#2563eb"
    },
    "Disciplinar Obligatoria": {
      "nombre": "Disciplinar Obligatoria",
      "descripcion": "Asignaturas específicas obligatorias del programa",
      "creditos_minimos": 78,
      "color": "#57844A"
    },
    "Disciplinar Optativa": {
      "nombre": "Disciplinar Optativa",
      "descripcion": "Asignaturas específicas optativas del programa",
      "creditos_minimos": 15,
      "color": "#7c3aed"
    },
    "Libre Elección": {
      "nombre": "Libre Elección",
      "descripcion": "Asignaturas de libre elección del estudiante",
      "creditos_minimos": 6,
      "color": "#059669"
    },
    "Trabajo de Grado": {
      "nombre": "Trabajo de Grado",
      "descripcion": "Asignaturas relacionadas con el trabajo final de grado",
      "creditos_minimos": 6,
      "color": "#f59e0b"
    }
  },
  "configuracion": {
    "creditos_totales_programa": 156,
    "semestres_programa": 10,
    "creditos_maximos_por_semestre": 20,
    "creditos_minimos_por_semestre": 12
  }
}