[
  {
    "id": "306828d5-9439-44ea-b427-00fa4a36f829",
    "nombre": "Nuevo plan",
    "fechaCreacion": "2025-07-19",
    "usuario": "25ac1ddf-ad47-451e-b9ab-853bf59f7959",
    "matriculas": [],
    "creditos": {
      "fundamentacionObligatoria": 0,
      "fundamentacionOptativa": 0,
      "disciplinarObligatoria": 0,
      "disciplinarOptativa": 0,
      "libreEleccion": 0,
      "total": 0
    }
  },
  {
    "id": "c8d5c33f-2dd9-4358-a0f7-41c9f137cfd4",
    "nombre": "1",
    "fechaCreacion": "2025-07-21",
    "usuario": "dev-user-1753123523317",
    "matriculas": [
      {
        "id": "m1753123687016",
        "posicion": 1,
        "asignaturas": [
          {
            "codigo": "1000004-M",
            "nombre": "CÁLCULO DIFERENCIAL",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS Estudiar los conceptos de límite y derivada para funciones de una variable real y utilizar estas ideas en la solución de problemas de optimización, trazado de curvas y razones de cambio. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brindadas, tanto por los profesores de planta como por los monitores académicos de posgrado y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
          },
          {
            "codigo": "1000005-M",
            "nombre": "CÁLCULO INTEGRAL",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [
              "1000004-M"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: General: lograr la apropiación por parte del. estudiante de los conceptos fundamentales del cálculo integral de funciones de una variable real y crear habilidades que le permitan aplicar estos conocimientos en problemas propios de su disciplina y abordar de manera elemental los conceptos de sucesiones y series. Específicos: - Conocer y manejar con propiedad el concepto de integral definida de una función real de una variable real y su relación con el concepto de primitiva o antiderivada, para facilitar los cálculos. - Estudiar algunas de las diferentes aplicaciones del concepto de integral. - Adquirir destrezas en el estudio de la convergencia de sucesiones y series."
          }
        ]
      },
      {
        "id": "m1753123695973",
        "posicion": 2,
        "asignaturas": [
          {
            "codigo": "1000008-M",
            "nombre": "GEOMETRÍA VECTORIAL Y ANALÍTICA",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: 1. Desarrollar destrezas y habilidades en el uso del álgebra vectorial de dos y tres dimensiones y sus aplicaciones a otras ramas de la matemática. Proporcionar los elementos básicos de la teoría de matrices y de la solución de sistemas de ecuaciones lineales. 2. Dibujar e interpretar gráficas de lugares geométricos en el plano y en el espacio. 3. Proporcionar al estudiante los conocimientos básicos para el futuro aprendizaje del cálculo, la física y el álgebra lineal."
          }
        ]
      }
    ],
    "creditos": {
      "fundamentacionObligatoria": 0,
      "fundamentacionOptativa": 0,
      "disciplinarObligatoria": 0,
      "disciplinarOptativa": 0,
      "libreEleccion": 0,
      "total": 0
    }
  },
  {
    "nombre": "1",
    "fechaCreacion": "2025-07-21",
    "usuario": "dev-user-1753123806860",
    "matriculas": [
      {
        "id": "m1753124614389",
        "posicion": 1,
        "asignaturas": [
          {
            "codigo": "1000004-M",
            "nombre": "CÁLCULO DIFERENCIAL",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS Estudiar los conceptos de límite y derivada para funciones de una variable real y utilizar estas ideas en la solución de problemas de optimización, trazado de curvas y razones de cambio. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brindadas, tanto por los profesores de planta como por los monitores académicos de posgrado y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
          },
          {
            "codigo": "3010408",
            "nombre": "Fundamentos de proyectos en ingeniería",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "El objetivo principal del curso, que utiliza la metodología de aprendizaje basado en proyectos, es desarrollar pensamiento crítico y habilidades para resolver problemas, analizando el entorno y desarrollando el estado del arte del tema a trabajar para plantear soluciones a problemas reales. A través del trabajo en equipo de un proyecto, el estudiante desarrolla habilidades profesionales transversales, tales como comunicación (escrita y oral), toma de decisiones, trabajo en equipo y gestión de proyectos. Objetivos - Conocer y aplicar técnicas de identificación, caracterización y análisis de problemáticas, problemas, necesidades u oportunidades (PNO) en ing. - Plantear y analizar alternativas de solución en ing. - Plantear soluciones en ing. adaptadas a PNO reales y/o locales. - Identificar costos de la propuesta. Temas que aportan conocimiento nuevo para desarrollar capacidades de formulación y ejecución de proyectos: - Marco Lógico. - Introducción al diseño en Ing. - Búsqueda de información relevante. - Toma de decisiones en ing. - Análisis básico de costos. El curso se enmarca en la identificación de una PNO del contexto real, el estudiante tiene la posibilidad de explorar temas de interés. Los proyectos pueden tener diferentes orígenes. Autocoevaluación aplicada a la nota final, instrumento que permite la evaluación entre los integrantes de cada equipo. Las notas serán las correspondientes al integrante que menos saque. Cada nota se relaciona con el trabajo en equipo. PRÁCTICA: el desarrollo de los temas de la asignatura podrá tener como complemento el desarrollo de prácticas extramurales, visitas técnicas, salidas de campo; en la ciudad de Medellín o en los Municipios del departamento de Antioquia; las cuales estarán supeditadas al cumplimiento de los requerimientos definidos por la Universidad Nacional de Colombia.Tendrá una duración de 1 o máximo 2 días según el alcance de la práctica(aprobado por el CFM 5/12/2024 oficio M.FM.1.004-7224 del 6/12/2024).",
            "avance": false,
            "avanceTipologia": "",
            "avancePorcentaje": ""
          }
        ]
      }
    ],
    "creditos": {
      "fundamentacionObligatoria": 0,
      "fundamentacionOptativa": 0,
      "disciplinarObligatoria": 0,
      "disciplinarOptativa": 0,
      "libreEleccion": 0,
      "total": 0
    },
    "id": "306829"
  },
  {
    "nombre": "1",
    "fechaCreacion": "2025-07-22",
    "usuario": "65296dff-328c-4c43-9332-28f3ac877ff9",
    "matriculas": [
      {
        "id": "m1753152185082",
        "posicion": 1,
        "asignaturas": [
          {
            "codigo": "1000004-M",
            "nombre": "CÁLCULO DIFERENCIAL",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS Estudiar los conceptos de límite y derivada para funciones de una variable real y utilizar estas ideas en la solución de problemas de optimización, trazado de curvas y razones de cambio. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brindadas, tanto por los profesores de planta como por los monitores académicos de posgrado y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
          },
          {
            "codigo": "1000008-M",
            "nombre": "GEOMETRÍA VECTORIAL Y ANALÍTICA",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: 1. Desarrollar destrezas y habilidades en el uso del álgebra vectorial de dos y tres dimensiones y sus aplicaciones a otras ramas de la matemática. Proporcionar los elementos básicos de la teoría de matrices y de la solución de sistemas de ecuaciones lineales. 2. Dibujar e interpretar gráficas de lugares geométricos en el plano y en el espacio. 3. Proporcionar al estudiante los conocimientos básicos para el futuro aprendizaje del cálculo, la física y el álgebra lineal."
          },
          {
            "codigo": "L001",
            "nombre": "HISTORIA DE COLOMBIA",
            "creditos": 3,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Estudio de los principales procesos históricos de Colombia desde la época precolombina hasta la actualidad."
          }
        ]
      },
      {
        "id": "m1753158982104",
        "posicion": 2,
        "asignaturas": [
          {
            "codigo": "3006906",
            "nombre": "MATEMÁTICAS DISCRETAS",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Objetivos generales: 1. Motivar al estudiante para que se familiarice con los métodos abstractos de razonamiento y de representación de la información. 2. Refinar la destreza matemática de los estudiantes, especialmente su habilidad para entender y escribir demostraciones y dividir problemas grandes en partes más manejables. 3. Mejorar el razonamiento matemático a través del estudio de estructuras discretas y análisis combinatorio y preparación de algoritmos. Objetivos específicos: 1. Introducir los primeros elementos de matemática discreta que permiten formar modelos y herramientas para analizar fenómenos del mundo real, que no pueden ser estudiados utilizando métodos del cálculo y el análisis. 2. Preparar al estudiante para la solución de problemas y prueba de algoritmos utilizando métodos que son apropiados para el uso del computador. 3. Destacar el papel de la teoría de grafos en la matemática y la informática. 4. Preparar al estudiante en métodos de demostración, entre los que se destaca la inducción matemática"
          },
          {
            "codigo": "1000003-M",
            "nombre": "ÁLGEBRA LINEAL",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [
              "1000008-M"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVO Asimilar los fundamentos del Algebra Lineal, a nivel elemental, pero con la profundidad necesaria para adquirir los conocimientos y habilidades básicas (capacidad de análisis y de razonamiento lógico - deductivo) para la solución de problemas en las cuales estén involucrados los elementos matemáticos de sistemas de ecuaciones lineales, espacios vectoriales, valores y vectores propios de una matriz y diagonalización de matrices. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brinadadas, tanto por los profesores de planta como por los monitores académicos de posgrado y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
          },
          {
            "codigo": "1000005-M",
            "nombre": "CÁLCULO INTEGRAL",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [
              "1000004-M"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: General: lograr la apropiación por parte del. estudiante de los conceptos fundamentales del cálculo integral de funciones de una variable real y crear habilidades que le permitan aplicar estos conocimientos en problemas propios de su disciplina y abordar de manera elemental los conceptos de sucesiones y series. Específicos: - Conocer y manejar con propiedad el concepto de integral definida de una función real de una variable real y su relación con el concepto de primitiva o antiderivada, para facilitar los cálculos. - Estudiar algunas de las diferentes aplicaciones del concepto de integral. - Adquirir destrezas en el estudio de la convergencia de sucesiones y series."
          }
        ]
      },
      {
        "id": "m1753158994651",
        "posicion": 3,
        "asignaturas": [
          {
            "codigo": "3010651",
            "nombre": "Estadística I",
            "creditos": 3,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [
              "1000003-M",
              "1000005-M"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Objetivos: Proporcionar elementos básicos acerca de la teoría de la probabilidad, variables aleatorias y distribuciones de variables aleatorias. Lograr que el estudiante se apropie de las técnicas básicas usadas frecuentemente en el análisis de datos, estimación de parámetros, inferencia estadística y regresión lineal. Metodología: la exposición de los temas es tipo magistral, con ejemplos ilustrativos y computacionales referente a cada uno de temas comentados en clase. Usualmente se usa un paquete estadístico para presentar de manera más adecuada y resumida algunos de los temas que así lo requieren y son base para la realización de trabajos propuestos en la evaluación y en los ejemplos de clase. los profesores ponen a disposición de los estudiantes horarios de atención y asesoría para reforzar los conceptos vistos en clase. asimismo, se cuenta con la ayuda de monitores los cuales tienen como tareas la realización de talleres complementarios y asesoría a estudiantes.",
            "customColor": "#dc2626"
          },
          {
            "codigo": "1000007-M",
            "nombre": "ECUACIONES DIFERENCIALES",
            "creditos": 4,
            "tipologia": "Fundamentación Optativa",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: -Modelar por medio de ecuaciones diferenciales algunos sistemas simples y predecir su comportamiento. -Comprender y utilizar las diferentes técnicas analíticas y cualitativas para resolver ecuaciones diferenciales. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brindadas, tanto por los profesores de planta como por los monitores académicos de posgrado y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
          },
          {
            "codigo": "3006915",
            "nombre": "ESTADÍSTICA II",
            "creditos": 4,
            "tipologia": "Fundamentación Optativa",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "El curso de Estadística II tiene como objetivo general, conocer y profundizar en los fundamentos básicos, propiedades y aplicaciones de los modelos de regresión lineal y de los elementos del muestreo. El curso tendrá una orientación teórico-práctica, sin mucho rigor matemático."
          }
        ]
      },
      {
        "id": "m1753159176766",
        "posicion": 4,
        "asignaturas": [
          {
            "codigo": "L002",
            "nombre": "FILOSOFÍA POLÍTICA",
            "creditos": 3,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Introducción a los conceptos fundamentales de la filosofía política y su aplicación en el análisis de sistemas políticos contemporáneos."
          },
          {
            "codigo": "L003",
            "nombre": "DEPORTE FORMATIVO I",
            "creditos": 1,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Práctica de actividades deportivas para el desarrollo físico y la promoción de hábitos saludables."
          },
          {
            "codigo": "L005",
            "nombre": "ARTE Y CULTURA",
            "creditos": 2,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Exploración de diferentes manifestaciones artísticas y culturales, desarrollando la sensibilidad estética y cultural."
          },
          {
            "codigo": "L006",
            "nombre": "ECOLOGÍA BÁSICA",
            "creditos": 3,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Estudio de los ecosistemas, las relaciones entre organismos y su ambiente, y los principios de conservación ambiental."
          },
          {
            "codigo": "3010438",
            "nombre": "Introducción a la ingeniería de sistemas e informática",
            "creditos": 2,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "DESCRIPCIÓN Esta asignatura busca desarrollar en los participantes una visión general y contextualizada del quehacer de un Ingeniero de Sistemas, mediante la interacción con otros alumnos, profesores y profesionales del área. Adicionalmente, pretende desarrollar capacidad individual y grupal para el desarrollo del proceso de aprendizaje mediante proyectos. OBJETIVO GENERAL Desarrollar en el estudiante una visión general de la ingeniería en sistemas, áreas de desempeño, impacto social e implicaciones actuales y futuras. OBJETIVOS ESPECÍFICOS 1. Conocer la importancia de la profesión de ingeniería de sistemas. 2. Identificar los problemas básicos de la ingeniería de sistemas. 3. Iniciar a los estudiantes en el conocimiento de la metodología de trabajo en ingeniería",
            "customColor": "#059669"
          },
          {
            "codigo": "3010435",
            "nombre": "Fundamentos de programación",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "DESCRIPCION El objetivo de este curso es introducir al estudiante en las técnicas básicas de programación. Busca desarrollar en el estudiante la capacidad el analisis de problemas y su solución empleando algoritmos. Para lograr este objetivo el alumno debe adquirir una serie de conocimientos, capacidades y aptitudes que le permitan enfrentar diversas situciones en relacionadas conb su carrera. OBJETIVO GENERAL Desarrollar en el estudiante la capacidad de analisis necesario para abordar problemas cuya solución pueda ser alcanzada empleando algoritmos. OBJETIVOS ESPECIFICOS 1. Comprender los fundamentos de la programación. 2. Entender los mecanismos de la programación estructurada. 3. Entender el flujo de ejecución de un programa de computador. 4. Analizar problemas y desarrollar su solución mediante algoritmos.",
            "avance": false,
            "avanceTipologia": "",
            "avancePorcentaje": ""
          },
          {
            "codigo": "1000019-M",
            "nombre": "FÍSICA MECÁNICA",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: Generales: - Desarrollar los conceptos fundamentales de la mecánica Newtoniana y aplicar estos a diversas situaciones típicas de la física. - Desarrollar en los estudiantes capacidad para enfrentar y resolver problemas e iniciarlos en los métodos experimentales de la física. Específicos: - Definir las magnitudes físicas fundamentales y dar una descripción matemática del movimiento de las partículas. - Estudiar el contenido fundamental de las leyes de Newton. - Presentar los conceptos de trabajo y energía con la respectiva ley de conservación de la energía mecánica. - Estudiar la relación entre la cantidad de movimiento y las fuerzas en un sistema de partículas y entre la energía cinética y los trabajos. - Estudiar el equilibrio de un cuerpo rígido e introducir su dinámica de rotación. METODOLOGÍA Y EVALUACIÓN En la semana habrán tres sesiones de a 2 horas. Una sesión corresponderá a una práctica de laboratorio; las otras dos corresponderán a clases magistrales."
          }
        ]
      },
      {
        "id": "m1753163293629",
        "posicion": 5,
        "asignaturas": [
          {
            "codigo": "3007744",
            "nombre": "PROGRAMACIÓN ORIENTADA A OBJETOS",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: 1.1 GENERAL: Presentar al estudiante los conceptos y técnicas asociados al desarrollo de aplicaciones informáticas, con base en el paradigma de los objetos. 1.2 ESPECÍFICOS: - Presentar tanto los elementos conceptuales como ejemplos y aplicaciones del paradigma de los objetos. - Introducir los tópicos relacionados con el paradigma de los objetos con independencia del lenguaje de programación, haciendo énfasis en los aspectos conceptuales y en los aspectos arquitectónicos del diseño. - Usar el paradigma de los objetos, en el contexto de los diferentes modelos lingüísticos, a través de ejemplos y cumplimiento de objetivos de trabajo. (se trabajarán en particular el lenguaje C++ -Microsoft Visual C++- y el lenguaje SMALLTALK)."
          },
          {
            "codigo": "3010426",
            "nombre": "Teoría de lenguajes de programación",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3006906",
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Descripción y Objetivos: Este curso tiene como objetivo general el desarrollo de conocimientos, habilidades y destrezas para el diseño e implementación de lenguajes de programación."
          }
        ]
      },
      {
        "id": "m1753163295866",
        "posicion": 6,
        "asignaturas": [
          {
            "nombre": "ESTRUCTURA DE DATOS",
            "codigo": "3007741",
            "creditos": "3",
            "tipologia": "Disciplinar Obligatoria",
            "descripcion": "OBJETIVOS:\n\n- Presentarle al estudiante los conceptos y técnicas asociadas a la definición de agregados de datos y algoritmos para su manipulación, en contexto de los lenguajes procedí mentales.\n- Agregados como concepto relativo a la óptica del observador\n- Operaciones sobre los agregados: constructores y Destructores, Cursor y Navegación, Actualización y Consulta.\n- Interfaz e implementación: El agregado como un tipo abstracto sobre el que poseen solo las operaciones.\n- Eficiencia de los algoritmos: Orden y tipicación de los algoritmos (voraces, divide y vencerás, precondicionamiento, probalísticos).\n- Estructura de datos iteradas y su efecto en las operaciones:  listas ordenadas, arboles, arboles de búsqueda, arboles +, estructuras Hash.\n\nEn el curso se presentan tanto los elementos conceptuales como ejemplos y algoritmos específicos.  Los tópicos se presentan con independencia del lenguaje de programación, haciendo énfasis en los aspectos conceptuales y en los aspectos estructurales del diseño. Para los proyectos de programación el estudiante deberá usar el lenguaje C (o C++).\n\nMetodología y Evaluación:\nSe combinarán conferencias magistrales para la presentación de los conceptos y ejemplos básicos, con una serie de talleres dirigidos, orientados a facilitarle al estudiante la elaboración de los proyectos de programación involucrados en el curso.\n\nSe propondrá una serie de proyectos de programación orientados a reforzar los conceptos presentados, que deben ser elaborados de forma individual por los estudiantes y discutidos en clases especiales para tal fin.\n\nEvaluación:\nTrabajos: 15%\nExámenes: 75%\nExámenes cortos: 10%",
            "prerrequisitos": [
              "3007744"
            ],
            "avance": false,
            "avanceTipologia": "",
            "avancePorcentaje": "",
            "id": "1753139745368"
          },
          {
            "codigo": "3007867",
            "nombre": "SISTEMAS OPERATIVOS",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3010426",
              "3006906",
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVO GENERAL: Ofrecer a los alumnos una descripción, lo más detallada posible, de los conceptos fundamentales, estructura y funcionamiento de los sistemas operativos de computadores. OBJETIVOS ESPECÍFICOS: - Definir qué es un sistema operativo y los servicios que debe proporcionar. - Diferenciar los elementos básicos que componen un sistema operativo, cuáles operaciones se pueden realizar con ellos y su correspondencia con los elementos básicos de un computador como el procesador, la memoria RAM y los discos. - Capacitar al alumno como usuario y como programador en el entorno del sistema."
          },
          {
            "codigo": "3007324",
            "nombre": "INVESTIGACIÓN DE OPERACIONES I",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "1000003-M",
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVO Proporcionar herramientas avanzadas de investigación de operaciones que le permitan al ingeniero estudiar y planificar sistemas complejos con el fin de plantear alternativas que en lo posible sean óptimas para su adecuado funcionamiento tales como: programación lineal, programación dinámica y programación y control de proyectos."
          },
          {
            "codigo": "3007853",
            "nombre": "INGENIERÍA DE SOFTWARE",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3007744",
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: Objetivo General: Desarrollar habilidades de modelado con miras al desarrollo de Soluciones Informáticas a problemas prácticos, empleando para ello un enfoque metodológico. Objetivos Específicos: - Caracterizar los diferentes modelos de UML y otros paradigmas necesarios para la definición, análisis y diseño orientados a objetos de soluciones informáticas. - Emplear los lineamientos teóricos del objetivo anterior en la elaboración del prototipo de una solución informática a un problema planteado. - Garantizar el desarrollo de habilidades para la elaboración de modelos en diferentes métodos de desarrollo."
          }
        ]
      },
      {
        "id": "m1753163297835",
        "posicion": 7,
        "asignaturas": [
          {
            "nombre": "BASE DE DATOS I",
            "codigo": "3007847",
            "creditos": "3",
            "tipologia": "Disciplinar Obligatoria",
            "descripcion": "Objetivo general: \nPresentar los conceptos básicos referentes a la teoría de bases de datos, formas de modelarlas, manipularlas y permitir la interacción con ellas mediante un sistema de gestión de bases de datos (SGBD). \n\nObjetivos específicos: \n- Modelar una base de datos tanto conceptual como lógicamente.\n- Hacer uso de un lenguaje de base de datos para la implementación y manipulación de bases de datos relacionales.\n- Construir interfaces de usuario para la interacción con un SGBD.  \n\nMetodología:\n- Clases magistrales.\n- Clases prácticas en la sala de cómputo.\n- Asesorías extra clase.\n- Desarrollo de ejercicios en clase por parte de los estudiantes y el profesor.\n- Asignación de trabajos en grupo.\n\n Evaluación: \n- Exámenes.\n- Trabajos en entregas parciales.",
            "prerrequisitos": [
              "3007741"
            ],
            "avance": false,
            "avanceTipologia": "",
            "avancePorcentaje": "",
            "id": "1753139675616"
          },
          {
            "codigo": "3007865",
            "nombre": "REDES Y TELECOMUNICACIONES I",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3007867",
              "3010426",
              "3006906",
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVO GENERAL: Al finalizar el curso, el estudiante estará en capacidad de distinguir las distintas tipologías de redes para comunicar varios computadores y aplicar técnicas para desarrollar aplicaciones que utilicen una red; teniendo en cuenta las distintas arquitecturas en cada capa o nivel de abstracción. OBJETIVOS ESPECIFICOS: - Identificar los elementos involucrados en una red de computadores. - Diferenciar las capas o niveles para el establecimiento de una red. - Diseñar redes de telecomunicaciones. - Detectar y resolver problemas en la comunicación de datos entre dos máquinas conectadas."
          },
          {
            "codigo": "3007852",
            "nombre": "INGENIERÍA DE REQUISITOS",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3007853",
              "3007744",
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: OBJETIVO GENERAL: Practicar los conocimientos adquiridos en las asignaturas previas en la elaboración de las fases de definición y análisis de un Sistema Informático que solucione los problemas particulares de una organización. OBJETIVOS ESPECÍFICOS: - Identificar el dominio de un problema particular, reconociendo sus problemas y el entorno de la organización. - Conceptualizar una solución informática que tome en consideración los problemas de la organización. - Especificar la solución empleando para ello métodos formales y semiformales. METODOLOGÍA Y EVALUACIÓN: - Clases Magistrales. - Elaboración de un Trabajo Práctico por entregas. - Foros de Discusión."
          },
          {
            "codigo": "L007",
            "nombre": "EMPRENDIMIENTO E INNOVACIÓN",
            "creditos": 3,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Desarrollo de competencias emprendedoras y habilidades para la innovación en diferentes contextos profesionales."
          },
          {
            "codigo": "L010",
            "nombre": "PSICOLOGÍA GENERAL",
            "creditos": 3,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Fundamentos de la psicología, procesos mentales básicos y comportamiento humano."
          },
          {
            "codigo": "L011",
            "nombre": "COMUNICACIÓN ORAL Y ESCRITA",
            "creditos": 3,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Desarrollo de competencias comunicativas en expresión oral y escrita para contextos académicos y profesionales."
          },
          {
            "codigo": "L012",
            "nombre": "FRANCÉS BÁSICO I",
            "creditos": 3,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Introducción al idioma francés con énfasis en competencias básicas de comunicación oral y escrita."
          },
          {
            "codigo": "L019",
            "nombre": "SOCIOLOGÍA GENERAL",
            "creditos": 3,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Estudio de los fenómenos sociales, estructuras sociales y procesos de cambio en la sociedad contemporánea."
          }
        ]
      },
      {
        "id": "m1753163435177",
        "posicion": 8,
        "asignaturas": [
          {
            "codigo": "3007848",
            "nombre": "BASE DE DATOS II",
            "creditos": 3,
            "tipologia": "Disciplinar Optativa",
            "prerrequisitos": [
              "3007847",
              "3007744",
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "El objetivo general de la asignatura es ampliar los conocimientos en Bases de Datos para un mejor aprovechamiento de esta tecnología, adquiriendo destrezas y habilidades para la creación de sistemas de bases de datos de alta calidad y para la administración de una base de datos, recurso vital para cualquier organización actual. El alumno después de cursar la asignatura estará en capacidad de: - Crear procedimientos o funciones almacenadas, disparadores y otros objetos en un Sistema Gestor de Bases de Datos específico. - Diferenciar los conceptos de la orientación por objetos del Modelo Objeto-Relacional y establecer comparaciones frente al modelo relacional. - Distinguir cada una de las responsabilidades de un administrador de una base de datos y cómo llevarlas a cabo. - Diseñar y construir sistemas de bases de datos en la Web."
          }
        ]
      },
      {
        "id": "m1753163565149",
        "posicion": 9,
        "asignaturas": [
          {
            "codigo": "3010440",
            "nombre": "Calidad de software",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3007852",
              "3007853",
              "3007744"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Hoy en dia la calidad se ha convertido en un aspecto importante en el contexto del desarrollo de software. La competitividad del mercado y los nuevos avances tecnológicos requieren de mayor innovación y calidad en los productos. Cada vez se incrementa el número de procesadores, se agregan nuevas funcionalidades, se requiere de nuevas características de conectividad, de seguridad, de interoperabilidad entre muchas otras. El riesgo de fallos en los sistemas aumenta conforme la creciente complejidad tecnológica y contenido software]. Evidencia de ello es el incremento de reportes de incidentes con software. En esta asignatura se presentan los conceptos básicos en sistemas de gestion de calidad, proceso software, modelos de calidad y métricas, de tal forma que pueda ser llevado a contextos industriales. OBJETIVO GENERAL Promover la cultura de la calidad en las diferentes fases del ciclo de vida del software, como una manera de garantizar la entrega de buenas aplicaciones. OBJETIVOS ESPECIFICOS 1. Lograr la difusión de los lineamientos teóricos y los diferentes estándares asociados con procesos de calidad del software. 2. Establecer los métodos necesarios para incorporar los estándares en las diferentes organizaciones de software. 3. Promover los procesos de ejecución de pruebas al interior de las organizaciones para garantizar la calidad de los productos.",
            "avance": false,
            "avanceTipologia": "",
            "avancePorcentaje": ""
          },
          {
            "codigo": "3011020",
            "nombre": "Fundamentos de analítica",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3010651",
              "3007847",
              "3007741",
              "3007744",
              "3010435",
              "1000003-M",
              "1000005-M"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "La Analítica se refiere al uso de grandes volúmenes de datos para el análisis y la toma de decisiones en contextos empresariales y de negocios. En esta área confluyen los conocimientos y saberes propios de cuatro grandes áreas de conocimiento: la computación, la estadística, el aprendizaje de máquinas y la investigación de operaciones. En este curso se abordan sus elementos fundamentales de la analítica y se busca que el estudiante desarrolle conocimientos, destrezas y habilidades básicas para la manipulación y modelado de grandes volúmenes de datos y la toma de decisiones.",
            "avance": false,
            "avanceTipologia": "",
            "avancePorcentaje": ""
          },
          {
            "codigo": "3010408",
            "nombre": "Fundamentos de proyectos en ingeniería",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "El objetivo principal del curso, que utiliza la metodología de aprendizaje basado en proyectos, es desarrollar pensamiento crítico y habilidades para resolver problemas, analizando el entorno y desarrollando el estado del arte del tema a trabajar para plantear soluciones a problemas reales. A través del trabajo en equipo de un proyecto, el estudiante desarrolla habilidades profesionales transversales, tales como comunicación (escrita y oral), toma de decisiones, trabajo en equipo y gestión de proyectos. Objetivos - Conocer y aplicar técnicas de identificación, caracterización y análisis de problemáticas, problemas, necesidades u oportunidades (PNO) en ing. - Plantear y analizar alternativas de solución en ing. - Plantear soluciones en ing. adaptadas a PNO reales y/o locales. - Identificar costos de la propuesta. Temas que aportan conocimiento nuevo para desarrollar capacidades de formulación y ejecución de proyectos: - Marco Lógico. - Introducción al diseño en Ing. - Búsqueda de información relevante. - Toma de decisiones en ing. - Análisis básico de costos. El curso se enmarca en la identificación de una PNO del contexto real, el estudiante tiene la posibilidad de explorar temas de interés. Los proyectos pueden tener diferentes orígenes. Autocoevaluación aplicada a la nota final, instrumento que permite la evaluación entre los integrantes de cada equipo. Las notas serán las correspondientes al integrante que menos saque. Cada nota se relaciona con el trabajo en equipo. PRÁCTICA: el desarrollo de los temas de la asignatura podrá tener como complemento el desarrollo de prácticas extramurales, visitas técnicas, salidas de campo; en la ciudad de Medellín o en los Municipios del departamento de Antioquia; las cuales estarán supeditadas al cumplimiento de los requerimientos definidos por la Universidad Nacional de Colombia.Tendrá una duración de 1 o máximo 2 días según el alcance de la práctica(aprobado por el CFM 5/12/2024 oficio M.FM.1.004-7224 del 6/12/2024).",
            "avance": false,
            "avanceTipologia": "",
            "avancePorcentaje": ""
          },
          {
            "codigo": "3010476",
            "nombre": "Introducción a la inteligencia artificial",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3010651",
              "3007847",
              "3007741",
              "3007744",
              "1000003-M",
              "1000005-M"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "El objetivo de la asignatura es ofrecer una introducción a la Inteligencia Artificial: sus fundamentos, áreas de aplicación y problemas que intenta resolver, así como desarrollar un conjunto de las técnicas más usadas en este campo. En particular se estudiarán diferentes sistemas desarrollados en IA, así como modelos representación del conocimiento."
          },
          {
            "codigo": "3007331",
            "nombre": "SIMULACIÓN DE SISTEMAS",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3010651",
              "3007324",
              "3010435",
              "1000003-M",
              "1000005-M"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: El objetivo general está compuesto por dos partes. En su primera parte se estudia la simulación de eventos discretos, sus fundamentos, aspectos metodológicos generales y un buen número de aplicaciones, casos y ejemplos; además, se exponen los elementos básicos de software específico para la simulación discreta SIMUL8. En su segunda parte se presentan otras aproximaciones para la simulación con Dinámica de Sistemas y Simulación Basada en Agentes."
          },
          {
            "codigo": "3011018",
            "nombre": "Creación multimedia",
            "creditos": 3,
            "tipologia": "Disciplinar Optativa",
            "prerrequisitos": [
              "3007744"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "En esta asignatura, el/la estudiante adquirirá competencias en la ingeniería aplicada al arte en diferentes formatos digitales."
          },
          {
            "codigo": "TEST001",
            "nombre": "PRUEBA API BACKEND",
            "creditos": 4,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Asignatura de prueba para verificar que el frontend consume la API del backend correctamente.",
            "avance": false,
            "avanceTipologia": "",
            "avancePorcentaje": ""
          }
        ]
      },
      {
        "id": "m1753163611166",
        "posicion": 10,
        "asignaturas": [
          {
            "codigo": "3010415",
            "nombre": "Introducción al análisis de decisiones",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3007331",
              "3010651",
              "3007324",
              "3010435",
              "1000003-M",
              "1000005-M"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Objetivo: Brindar a los estudiantes elementos y herramientas de la teoría moderna de análisis de decisiones, así como diferentes herramientas de software, para enfrentar los procesos de toma de decisión al interior de la organización. Objetivos Específicos - Enseñar las diferencias existentes entre Modelación de Decisiones, Modelación de Incertidumbres y Modelación de Preferencias. - Presentar y discutir los posibles criterios a tener en cuenta en los procesos de toma de decisiones. - Presentar y discutir algunos métodos de análisis multiobjetivo y sus aplicaciones en procesos de toma de decisiones. - Aprender a manejar algunos sistemas soporte a la decisión. Metodología: Exposiciones magistrales presentadas por medio de Video Beam, y copias de las clases y difusión de información vía Internet. Realización de por lo menos, cuatro parciales y dos trabajos"
          },
          {
            "nombre": "Estructuración y evaluación de proyectos de ingeniería",
            "codigo": "3010407",
            "creditos": "3",
            "tipologia": "Disciplinar Obligatoria",
            "descripcion": "El objetivo principal del curso, que utiliza la metodología de aprendizaje basado en proyectos, es desarrollar pensamiento crítico y habilidades para resolver problemas, analizando el entorno y desarrollando el estado del arte del tema a trabajar para plantear soluciones a problemas reales. A través del trabajo en equipo de un proyecto, se desarrolla habilidades profesionales transversales, como comunicación (escrita y oral), toma de decisiones, trabajo en equipo y gestión de proyectos. En las herramientas ambientales, financieras y económicas (AFE) se estudian casos en parejas aleatorias para el desarrollo de habilidades transversales y apropiación de conceptos, se realiza un parcial individual de herramientas financieras para evaluar conceptos. Aporta conocimientos en herramientas de estructuración y evaluación de proyectos (EEP) desde AFE con aspectos técnicos y legales, para evaluar factibilidad y viabilidad de proy. productivos. Objetivos- Identificar, caracterizar y analizar un problema u oportunidad (PO) reales. - Adquirir conocimientos avanzados de gestión y planeación de proy. de ing.- Introducir en el diseño y uso de herramientas para la (EEP) de ing. a nivel AFE. - Evaluar la viabilidad técnica, AFE de proyectos productivos. Autocoevaluación aplicada a la nota final del proyecto (50%), instrumento que permite evaluar trabajo en equipo. Las notas serán las correspondientes al integrante que menos saque. Cada nota se relaciona con trabajo en equipo.\nPRÁCTICA: el desarrollo de los temas de la asignatura podrá tener como complemento el desarrollo de prácticas extramurales, visitas técnicas, salidas de campo; en la ciudad de Medellín o en los Municipios del departamento de Antioquia; las cuales estarán supeditadas al cumplimiento de los requerimientos definidos por la Universidad Nacional de Colombia. Tendrá una duración de 1 o máximo 2 días según el alcance de la práctica (aprobado por el Consejo de la Facultad de Minas el 5 de diciembre de 2024, Acta 33).",
            "prerrequisitos": [
              "3010408"
            ],
            "avance": true,
            "avanceTipologia": "Disciplinar",
            "avancePorcentaje": "20",
            "id": "1753139922486"
          },
          {
            "codigo": "3011019",
            "nombre": "Desarrollo web I (LA MEJOR)",
            "creditos": 3,
            "tipologia": "Disciplinar Optativa",
            "prerrequisitos": [
              "3007847",
              "3007865"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "En esta asignatura, el/la estudiante aplicará sus conocimientos en programación y desarrollo de software en general para construir un desarrollo para la web con un enfoque práctico y aplicativo. Recorrerá desde los fundamentos esenciales del protocolo HTTP, pasando por las tecnologías de frontend y backend, para terminar con un conocimiento esencial en la construcción de aplicaciones web fullstack."
          },
          {
            "codigo": "3006931",
            "nombre": "INTRODUCCIÓN AL MANEJO DE DATOS ESTADÍSTICOS",
            "creditos": 4,
            "tipologia": "Fundamentación Optativa",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Este curso esta diseñado para los estudiantes de primer semetre de la carrera de estadística para que adquieran un panorama general de los tópicos fundamentales de la estadística y para estimular el pensamiento estadístico. Objetivos: 1. Explorar de manera intuitiva los principales tópicos en estadística. 2. Manejar el vocabulario esencial en el contexto estadístico. 3. Realizar trabajos sencillos de experimentación en el contexto de la rigurosidad estadística. 4. Reconocer el uso apropiado de la estadística en contextos reales y distinguirlo del abuso que se puede hacer de la estadística."
          },
          {
            "codigo": "L017",
            "nombre": "TEATRO Y EXPRESIÓN",
            "creditos": 2,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Desarrollo de habilidades expresivas y comunicativas a través de técnicas teatrales y dramáticas."
          },
          {
            "codigo": "3007595",
            "nombre": "REDES TELEINFORMATICAS I",
            "creditos": 4,
            "tipologia": "Disciplinar Optativa",
            "prerrequisitos": [
              "3007847"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Este curso introduce la arquitectura, funciones, componentes y modelos de Internet y otras redes de computadores. Utiliza los modelos por capas OSI y TCP para examinar la naturaleza y roles de protocolos y servicios en las capas de aplicación, red, enlace de datos y física. Los principios y estructura del direccionamiento IP y las bases de conceptos, medios y operaciones de Ethernet son dados como base del curso. Los laboratorios utilizan un modelo Internet para analizar datos reales sin afectar el desempeño de la red. Actividades en el software Packet Tracer ayudan a analizar la operación de la red y de diferentes protocolos, además de construir pequeños ambientes simulados de redes. Al final del curso, los estudiantes construyen simples topologías LAN aplicando los conceptos básicos de cableado, realizando configuraciones básicas en dispositivos como switches y routers, así como la implementación de esquemas de direccionamiento."
          }
        ]
      },
      {
        "id": "m1753163614916",
        "posicion": 11,
        "asignaturas": [
          {
            "codigo": "3010439",
            "nombre": "Proyecto Integrado de Ingeniería",
            "creditos": 4,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "El objetivo principal de este curso, que utiliza la metodología de aprendizaje basado en proyectos, es desarrollar en el estudiante pensamiento crítico y habilidades para resolver problemas, mediante el análisis del entorno y la búsqueda del estado del arte en el tema a desarrollar, y plantear soluciones sostenibles a problemas reales. A través del trabajo en un proyecto de equipo, y del conocimiento de otros proyectos, el estudiante también desarrolla habilidades profesionales transversales, tales como la comunicación (escrita y oral), la toma de decisiones, el trabajo en equipo y la gestión de proyectos. Objetivos del curso. - Formular un proyecto de ingeniería dirigido a la solución de un problema real o al aprovechamiento de una oportunidad. - Adquirir habilidades de gestión y planeación de proyectos de ingeniería. - Adquirir conocimientos sobre métodos, estrategias y técnicas para el diseño en ingeniería. - Proponer y desarrollar una solución real aplicando conceptos de diseño en ingeniería a nivel técnico, ambiental y financiero. - Evaluar la viabilidad técnica, financiera y ambiental mediante técnicas de análisis, modelos y prototipos de funcionamiento. Autocoevaluación aplicada a la nota final del proyecto (100%), se aplicará un instrumento que permita la evaluación entre los integrantes del grupo y los equipos conformados a su interior. Las notas del equipo serán las correspondientes al integrante que menos saque. Cada nota es relacionada con el trabajo en equipo. PRÁCTICA: el desarrollo de los temas de la asignatura podrá tener como complemento el desarrollo de prácticas extramurales, visitas técnicas, salidas de campo; en la ciudad de Medellín o en los Municipios del departamento de Antioquia; las cuales estarán supeditadas al cumplimiento de los requerimientos definidos por la Universidad Nacional de Colombia. Tendrá una duración de 1 o máximo 2 días según el alcance de la práctica (Consejo de la Facultad de Minas el 5 de diciembre de 2024, Acta 33)."
          },
          {
            "codigo": "3011167",
            "nombre": "Ciberseguridad",
            "creditos": 3,
            "tipologia": "Disciplinar Optativa",
            "prerrequisitos": [
              "3007847",
              "3007595"
            ],
            "correrquisitos": [],
            "disponible": false,
            "descripcion": "La ciberseguridad se refiere a un conjunto de prácticas, tecnologías y medidas diseñadas para proteger los sistemas informáticos, las redes, los dispositivos y los datos de ataques, daños o accesos no autorizados. El objetivo principal de la ciberseguridad es garantizar la confidencialidad, integridad y disponibilidad de la información y los recursos digitales en un entorno cada vez más interconectado y propenso a amenazas. Esta asignatura incluye tanto teoría como práctica, con ejercicios de laboratorio, simulaciones y proyectos prácticos para que los estudiantes puedan aplicar los conocimientos adquiridos."
          },
          {
            "codigo": "3010757",
            "nombre": "Aplicaciones móviles",
            "creditos": 3,
            "tipologia": "Disciplinar Optativa",
            "prerrequisitos": [
              "3007847",
              "3007865"
            ],
            "correrquisitos": [],
            "disponible": false,
            "descripcion": "El curso de Introducción a las ciencias de la computación y aplicaciones móviles se enfoca en integrar en el estudiante: la comprensión amplia y robusta de la informática y la programación; cómo pensar algorítmicamente y resolver problemas de programación de manera eficiente; conceptos como abstracción, gestión de recursos, seguridad, ingeniería de software y bajo la perspectiva del desarrollo de aplicaciones móviles. Además, a través de proyectos prácticos, ganará experiencia en el desarrollo de aplicaciones móviles y sus paradigmas, arquitectura de aplicaciones e interfaces de usuario. El curso culmina en un proyecto final para el cual implementará una aplicación para resolver un problema específico."
          },
          {
            "codigo": "3011093",
            "nombre": "Computación paralela",
            "creditos": 3,
            "tipologia": "Disciplinar Optativa",
            "prerrequisitos": [
              "3007741",
              "3007847"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "En este curso se presentan los fundamentos de la computación en paralelo. Se presenta una introducción al tema y un conjunto de algoritmos convencionales para ilustrar el paralelismo, inicialmente, mediante algoritmos (pseudo-código). Se presenta posteriormente algún lenguaje de programación para implementar estos algoritmos. Luego, se presenta la aplicación del paralelismo mediante alguna herramienta o lenguaje de programación a un nivel más alto, es decir, mediante herramientas o lenguajes que ofrecen facilidades tales como funciones (o bibliotecas) preconstruidas que explotan el paralelismo. Objetivos: 1. Presentar los fundamentos de la computación en paralelo. 2. Presentar algoritmos donde se aplica programación en paralelo. 3. Presentar un lenguaje de programación que soporte paralelismo para implementar los algoritmos presentados. 4. Presentar una herramienta o lenguaje de programación que ofrezca funcionalidades de alto nivel para explotar el paralelismo."
          },
          {
            "codigo": "3006927",
            "nombre": "ESTADÍSTICA DESCRIPTIVA Y EXPLORATORIA",
            "creditos": 4,
            "tipologia": "Fundamentación Optativa",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "objetivos. conocer y profundizar en las distintas técnicas de análisis exploratorio de datos, métodos para la recolección de datos, técnicas formales de inferencia estadística y técnicas de regresión y análisis de varianza. A traves de ejemplos reales de distintas disciplinas tales como Economía, Ciencias de la Salud, Ciencias Sociales y Biología entre otras, se exploran formas adecuadas para mirar y analizar datos."
          }
        ]
      },
      {
        "id": "m1753164078918",
        "posicion": 12,
        "asignaturas": [
          {
            "codigo": "3007869",
            "nombre": "CURSOS DE POSGRADO",
            "creditos": 6,
            "tipologia": "Trabajo de Grado",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Asignatura que permite al estudiante cursar materias de posgrado como parte de su formación de pregrado, contribuyendo a su preparación académica avanzada."
          }
        ]
      }
    ],
    "creditos": {
      "fundamentacionObligatoria": 0,
      "fundamentacionOptativa": 0,
      "disciplinarObligatoria": 0,
      "disciplinarOptativa": 0,
      "libreEleccion": 0,
      "total": 0
    },
    "id": "306830"
  },
  {
    "nombre": "2",
    "fechaCreacion": "2025-07-22",
    "usuario": "65296dff-328c-4c43-9332-28f3ac877ff9",
    "matriculas": [
      {
        "id": "m1753160954533",
        "posicion": 1,
        "asignaturas": [
          {
            "codigo": "3010435",
            "nombre": "Fundamentos de programación",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "DESCRIPCION El objetivo de este curso es introducir al estudiante en las técnicas básicas de programación. Busca desarrollar en el estudiante la capacidad el analisis de problemas y su solución empleando algoritmos. Para lograr este objetivo el alumno debe adquirir una serie de conocimientos, capacidades y aptitudes que le permitan enfrentar diversas situciones en relacionadas conb su carrera. OBJETIVO GENERAL Desarrollar en el estudiante la capacidad de analisis necesario para abordar problemas cuya solución pueda ser alcanzada empleando algoritmos. OBJETIVOS ESPECIFICOS 1. Comprender los fundamentos de la programación. 2. Entender los mecanismos de la programación estructurada. 3. Entender el flujo de ejecución de un programa de computador. 4. Analizar problemas y desarrollar su solución mediante algoritmos.",
            "avance": false,
            "avanceTipologia": "",
            "avancePorcentaje": ""
          },
          {
            "codigo": "1000008-M",
            "nombre": "GEOMETRÍA VECTORIAL Y ANALÍTICA",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: 1. Desarrollar destrezas y habilidades en el uso del álgebra vectorial de dos y tres dimensiones y sus aplicaciones a otras ramas de la matemática. Proporcionar los elementos básicos de la teoría de matrices y de la solución de sistemas de ecuaciones lineales. 2. Dibujar e interpretar gráficas de lugares geométricos en el plano y en el espacio. 3. Proporcionar al estudiante los conocimientos básicos para el futuro aprendizaje del cálculo, la física y el álgebra lineal."
          },
          {
            "codigo": "3006906",
            "nombre": "MATEMÁTICAS DISCRETAS",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Objetivos generales: 1. Motivar al estudiante para que se familiarice con los métodos abstractos de razonamiento y de representación de la información. 2. Refinar la destreza matemática de los estudiantes, especialmente su habilidad para entender y escribir demostraciones y dividir problemas grandes en partes más manejables. 3. Mejorar el razonamiento matemático a través del estudio de estructuras discretas y análisis combinatorio y preparación de algoritmos. Objetivos específicos: 1. Introducir los primeros elementos de matemática discreta que permiten formar modelos y herramientas para analizar fenómenos del mundo real, que no pueden ser estudiados utilizando métodos del cálculo y el análisis. 2. Preparar al estudiante para la solución de problemas y prueba de algoritmos utilizando métodos que son apropiados para el uso del computador. 3. Destacar el papel de la teoría de grafos en la matemática y la informática. 4. Preparar al estudiante en métodos de demostración, entre los que se destaca la inducción matemática"
          },
          {
            "codigo": "1000004-M",
            "nombre": "CÁLCULO DIFERENCIAL",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS Estudiar los conceptos de límite y derivada para funciones de una variable real y utilizar estas ideas en la solución de problemas de optimización, trazado de curvas y razones de cambio. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brindadas, tanto por los profesores de planta como por los monitores académicos de posgrado y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
          }
        ]
      },
      {
        "id": "m1753160955029",
        "posicion": 2,
        "asignaturas": [
          {
            "codigo": "1000005-M",
            "nombre": "CÁLCULO INTEGRAL",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [
              "1000004-M"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: General: lograr la apropiación por parte del. estudiante de los conceptos fundamentales del cálculo integral de funciones de una variable real y crear habilidades que le permitan aplicar estos conocimientos en problemas propios de su disciplina y abordar de manera elemental los conceptos de sucesiones y series. Específicos: - Conocer y manejar con propiedad el concepto de integral definida de una función real de una variable real y su relación con el concepto de primitiva o antiderivada, para facilitar los cálculos. - Estudiar algunas de las diferentes aplicaciones del concepto de integral. - Adquirir destrezas en el estudio de la convergencia de sucesiones y series."
          },
          {
            "codigo": "1000019-M",
            "nombre": "FÍSICA MECÁNICA",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: Generales: - Desarrollar los conceptos fundamentales de la mecánica Newtoniana y aplicar estos a diversas situaciones típicas de la física. - Desarrollar en los estudiantes capacidad para enfrentar y resolver problemas e iniciarlos en los métodos experimentales de la física. Específicos: - Definir las magnitudes físicas fundamentales y dar una descripción matemática del movimiento de las partículas. - Estudiar el contenido fundamental de las leyes de Newton. - Presentar los conceptos de trabajo y energía con la respectiva ley de conservación de la energía mecánica. - Estudiar la relación entre la cantidad de movimiento y las fuerzas en un sistema de partículas y entre la energía cinética y los trabajos. - Estudiar el equilibrio de un cuerpo rígido e introducir su dinámica de rotación. METODOLOGÍA Y EVALUACIÓN En la semana habrán tres sesiones de a 2 horas. Una sesión corresponderá a una práctica de laboratorio; las otras dos corresponderán a clases magistrales."
          },
          {
            "codigo": "1000003-M",
            "nombre": "ÁLGEBRA LINEAL",
            "creditos": 4,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [
              "1000008-M"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVO Asimilar los fundamentos del Algebra Lineal, a nivel elemental, pero con la profundidad necesaria para adquirir los conocimientos y habilidades básicas (capacidad de análisis y de razonamiento lógico - deductivo) para la solución de problemas en las cuales estén involucrados los elementos matemáticos de sistemas de ecuaciones lineales, espacios vectoriales, valores y vectores propios de una matriz y diagonalización de matrices. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brinadadas, tanto por los profesores de planta como por los monitores académicos de posgrado y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
          },
          {
            "codigo": "1000007-M",
            "nombre": "ECUACIONES DIFERENCIALES",
            "creditos": 4,
            "tipologia": "Fundamentación Optativa",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: -Modelar por medio de ecuaciones diferenciales algunos sistemas simples y predecir su comportamiento. -Comprender y utilizar las diferentes técnicas analíticas y cualitativas para resolver ecuaciones diferenciales. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brindadas, tanto por los profesores de planta como por los monitores académicos de posgrado y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
          },
          {
            "codigo": "3006915",
            "nombre": "ESTADÍSTICA II",
            "creditos": 4,
            "tipologia": "Fundamentación Optativa",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "El curso de Estadística II tiene como objetivo general, conocer y profundizar en los fundamentos básicos, propiedades y aplicaciones de los modelos de regresión lineal y de los elementos del muestreo. El curso tendrá una orientación teórico-práctica, sin mucho rigor matemático."
          }
        ]
      },
      {
        "id": "m1753160957848",
        "posicion": 3,
        "asignaturas": [
          {
            "codigo": "3010651",
            "nombre": "Estadística I",
            "creditos": 3,
            "tipologia": "Fundamentación Obligatoria",
            "prerrequisitos": [
              "1000003-M",
              "1000005-M"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Objetivos: Proporcionar elementos básicos acerca de la teoría de la probabilidad, variables aleatorias y distribuciones de variables aleatorias. Lograr que el estudiante se apropie de las técnicas básicas usadas frecuentemente en el análisis de datos, estimación de parámetros, inferencia estadística y regresión lineal. Metodología: la exposición de los temas es tipo magistral, con ejemplos ilustrativos y computacionales referente a cada uno de temas comentados en clase. Usualmente se usa un paquete estadístico para presentar de manera más adecuada y resumida algunos de los temas que así lo requieren y son base para la realización de trabajos propuestos en la evaluación y en los ejemplos de clase. los profesores ponen a disposición de los estudiantes horarios de atención y asesoría para reforzar los conceptos vistos en clase. asimismo, se cuenta con la ayuda de monitores los cuales tienen como tareas la realización de talleres complementarios y asesoría a estudiantes."
          },
          {
            "codigo": "3010438",
            "nombre": "Introducción a la ingeniería de sistemas e informática",
            "creditos": 2,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "DESCRIPCIÓN Esta asignatura busca desarrollar en los participantes una visión general y contextualizada del quehacer de un Ingeniero de Sistemas, mediante la interacción con otros alumnos, profesores y profesionales del área. Adicionalmente, pretende desarrollar capacidad individual y grupal para el desarrollo del proceso de aprendizaje mediante proyectos. OBJETIVO GENERAL Desarrollar en el estudiante una visión general de la ingeniería en sistemas, áreas de desempeño, impacto social e implicaciones actuales y futuras. OBJETIVOS ESPECÍFICOS 1. Conocer la importancia de la profesión de ingeniería de sistemas. 2. Identificar los problemas básicos de la ingeniería de sistemas. 3. Iniciar a los estudiantes en el conocimiento de la metodología de trabajo en ingeniería"
          },
          {
            "codigo": "L001",
            "nombre": "HISTORIA DE COLOMBIA",
            "creditos": 3,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Estudio de los principales procesos históricos de Colombia desde la época precolombina hasta la actualidad."
          },
          {
            "codigo": "L002",
            "nombre": "FILOSOFÍA POLÍTICA",
            "creditos": 3,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Introducción a los conceptos fundamentales de la filosofía política y su aplicación en el análisis de sistemas políticos contemporáneos."
          },
          {
            "codigo": "L003",
            "nombre": "DEPORTE FORMATIVO I",
            "creditos": 1,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Práctica de actividades deportivas para el desarrollo físico y la promoción de hábitos saludables."
          }
        ]
      },
      {
        "id": "m1753160958555",
        "posicion": 4,
        "asignaturas": [
          {
            "codigo": "3010426",
            "nombre": "Teoría de lenguajes de programación",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3006906",
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Descripción y Objetivos: Este curso tiene como objetivo general el desarrollo de conocimientos, habilidades y destrezas para el diseño e implementación de lenguajes de programación."
          },
          {
            "codigo": "3007744",
            "nombre": "PROGRAMACIÓN ORIENTADA A OBJETOS",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: 1.1 GENERAL: Presentar al estudiante los conceptos y técnicas asociados al desarrollo de aplicaciones informáticas, con base en el paradigma de los objetos. 1.2 ESPECÍFICOS: - Presentar tanto los elementos conceptuales como ejemplos y aplicaciones del paradigma de los objetos. - Introducir los tópicos relacionados con el paradigma de los objetos con independencia del lenguaje de programación, haciendo énfasis en los aspectos conceptuales y en los aspectos arquitectónicos del diseño. - Usar el paradigma de los objetos, en el contexto de los diferentes modelos lingüísticos, a través de ejemplos y cumplimiento de objetivos de trabajo. (se trabajarán en particular el lenguaje C++ -Microsoft Visual C++- y el lenguaje SMALLTALK)."
          },
          {
            "codigo": "L004",
            "nombre": "DEPORTE FORMATIVO II",
            "creditos": 1,
            "tipologia": "Libre Elección",
            "prerrequisitos": [
              "L003"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Continuación de la práctica deportiva con énfasis en el perfeccionamiento técnico y táctico."
          },
          {
            "codigo": "L005",
            "nombre": "ARTE Y CULTURA",
            "creditos": 2,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Exploración de diferentes manifestaciones artísticas y culturales, desarrollando la sensibilidad estética y cultural."
          },
          {
            "codigo": "L006",
            "nombre": "ECOLOGÍA BÁSICA",
            "creditos": 3,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Estudio de los ecosistemas, las relaciones entre organismos y su ambiente, y los principios de conservación ambiental."
          },
          {
            "codigo": "L007",
            "nombre": "EMPRENDIMIENTO E INNOVACIÓN",
            "creditos": 3,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Desarrollo de competencias emprendedoras y habilidades para la innovación en diferentes contextos profesionales."
          },
          {
            "codigo": "L008",
            "nombre": "ÉTICA PROFESIONAL",
            "creditos": 2,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Análisis de los principios éticos aplicados al ejercicio profesional y la responsabilidad social."
          },
          {
            "codigo": "L009",
            "nombre": "LENGUA DE SEÑAS COLOMBIANA",
            "creditos": 3,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Introducción a la lengua de señas colombiana como medio de comunicación con la comunidad sorda."
          },
          {
            "codigo": "L010",
            "nombre": "PSICOLOGÍA GENERAL",
            "creditos": 3,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Fundamentos de la psicología, procesos mentales básicos y comportamiento humano."
          },
          {
            "codigo": "L011",
            "nombre": "COMUNICACIÓN ORAL Y ESCRITA",
            "creditos": 3,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Desarrollo de competencias comunicativas en expresión oral y escrita para contextos académicos y profesionales."
          }
        ]
      },
      {
        "id": "m1753160960716",
        "posicion": 5,
        "asignaturas": [
          {
            "nombre": "ESTRUCTURA DE DATOS",
            "codigo": "3007741",
            "creditos": "3",
            "tipologia": "Disciplinar Obligatoria",
            "descripcion": "OBJETIVOS:\n\n- Presentarle al estudiante los conceptos y técnicas asociadas a la definición de agregados de datos y algoritmos para su manipulación, en contexto de los lenguajes procedí mentales.\n- Agregados como concepto relativo a la óptica del observador\n- Operaciones sobre los agregados: constructores y Destructores, Cursor y Navegación, Actualización y Consulta.\n- Interfaz e implementación: El agregado como un tipo abstracto sobre el que poseen solo las operaciones.\n- Eficiencia de los algoritmos: Orden y tipicación de los algoritmos (voraces, divide y vencerás, precondicionamiento, probalísticos).\n- Estructura de datos iteradas y su efecto en las operaciones:  listas ordenadas, arboles, arboles de búsqueda, arboles +, estructuras Hash.\n\nEn el curso se presentan tanto los elementos conceptuales como ejemplos y algoritmos específicos.  Los tópicos se presentan con independencia del lenguaje de programación, haciendo énfasis en los aspectos conceptuales y en los aspectos estructurales del diseño. Para los proyectos de programación el estudiante deberá usar el lenguaje C (o C++).\n\nMetodología y Evaluación:\nSe combinarán conferencias magistrales para la presentación de los conceptos y ejemplos básicos, con una serie de talleres dirigidos, orientados a facilitarle al estudiante la elaboración de los proyectos de programación involucrados en el curso.\n\nSe propondrá una serie de proyectos de programación orientados a reforzar los conceptos presentados, que deben ser elaborados de forma individual por los estudiantes y discutidos en clases especiales para tal fin.\n\nEvaluación:\nTrabajos: 15%\nExámenes: 75%\nExámenes cortos: 10%",
            "prerrequisitos": [
              "3007744"
            ],
            "avance": false,
            "avanceTipologia": "",
            "avancePorcentaje": "",
            "id": "1753139745368"
          },
          {
            "codigo": "3007324",
            "nombre": "INVESTIGACIÓN DE OPERACIONES I",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "1000003-M",
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVO Proporcionar herramientas avanzadas de investigación de operaciones que le permitan al ingeniero estudiar y planificar sistemas complejos con el fin de plantear alternativas que en lo posible sean óptimas para su adecuado funcionamiento tales como: programación lineal, programación dinámica y programación y control de proyectos."
          },
          {
            "codigo": "3007867",
            "nombre": "SISTEMAS OPERATIVOS",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3010426",
              "3006906",
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVO GENERAL: Ofrecer a los alumnos una descripción, lo más detallada posible, de los conceptos fundamentales, estructura y funcionamiento de los sistemas operativos de computadores. OBJETIVOS ESPECÍFICOS: - Definir qué es un sistema operativo y los servicios que debe proporcionar. - Diferenciar los elementos básicos que componen un sistema operativo, cuáles operaciones se pueden realizar con ellos y su correspondencia con los elementos básicos de un computador como el procesador, la memoria RAM y los discos. - Capacitar al alumno como usuario y como programador en el entorno del sistema."
          },
          {
            "codigo": "3007853",
            "nombre": "INGENIERÍA DE SOFTWARE",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3007744",
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: Objetivo General: Desarrollar habilidades de modelado con miras al desarrollo de Soluciones Informáticas a problemas prácticos, empleando para ello un enfoque metodológico. Objetivos Específicos: - Caracterizar los diferentes modelos de UML y otros paradigmas necesarios para la definición, análisis y diseño orientados a objetos de soluciones informáticas. - Emplear los lineamientos teóricos del objetivo anterior en la elaboración del prototipo de una solución informática a un problema planteado. - Garantizar el desarrollo de habilidades para la elaboración de modelos en diferentes métodos de desarrollo."
          }
        ]
      },
      {
        "id": "m1753161073570",
        "posicion": 6,
        "asignaturas": [
          {
            "nombre": "BASE DE DATOS I",
            "codigo": "3007847",
            "creditos": "3",
            "tipologia": "Disciplinar Obligatoria",
            "descripcion": "Objetivo general: \nPresentar los conceptos básicos referentes a la teoría de bases de datos, formas de modelarlas, manipularlas y permitir la interacción con ellas mediante un sistema de gestión de bases de datos (SGBD). \n\nObjetivos específicos: \n- Modelar una base de datos tanto conceptual como lógicamente.\n- Hacer uso de un lenguaje de base de datos para la implementación y manipulación de bases de datos relacionales.\n- Construir interfaces de usuario para la interacción con un SGBD.  \n\nMetodología:\n- Clases magistrales.\n- Clases prácticas en la sala de cómputo.\n- Asesorías extra clase.\n- Desarrollo de ejercicios en clase por parte de los estudiantes y el profesor.\n- Asignación de trabajos en grupo.\n\n Evaluación: \n- Exámenes.\n- Trabajos en entregas parciales.",
            "prerrequisitos": [
              "3007741"
            ],
            "avance": false,
            "avanceTipologia": "",
            "avancePorcentaje": "",
            "id": "1753139675616"
          },
          {
            "codigo": "3007865",
            "nombre": "REDES Y TELECOMUNICACIONES I",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3007867",
              "3010426",
              "3006906",
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVO GENERAL: Al finalizar el curso, el estudiante estará en capacidad de distinguir las distintas tipologías de redes para comunicar varios computadores y aplicar técnicas para desarrollar aplicaciones que utilicen una red; teniendo en cuenta las distintas arquitecturas en cada capa o nivel de abstracción. OBJETIVOS ESPECIFICOS: - Identificar los elementos involucrados en una red de computadores. - Diferenciar las capas o niveles para el establecimiento de una red. - Diseñar redes de telecomunicaciones. - Detectar y resolver problemas en la comunicación de datos entre dos máquinas conectadas."
          },
          {
            "codigo": "3010836",
            "nombre": "Cátedra de sistemas: una visión histórico-cultural de la computación",
            "creditos": 3,
            "tipologia": "Disciplinar Optativa",
            "prerrequisitos": [
              "3007741"
            ],
            "correrquisitos": [],
            "disponible": false,
            "descripcion": "Es posible definir la informática, también llamada computación, como el campo de estudio que abarca el conjunto de conocimientos, métodos y técnicas referentes al tratamiento automático de la información, junto con sus teorías y aplicaciones prácticas, con el fin de almacenar, procesar y transmitir información en formato digital utilizando sistemas computacionales. En este sentido, los sistemas de computación permiten implementar algoritmos, cumpliendo tres tareas básicas: recibir la información (entrada), procesarla y entregar los resultados (salida). En esta cátedra se consideran aspectos de la computación relacionados con sus principios, su historia (desde el primer ábaco sumerio; pasando por el desarrollo de autómatas y posteriormente procesadores; luego, la digitalización de la información y el desarrollo de software; el aporte de las mujeres y la diversidad de género en la computación; finalmente, avances recientes sobre la manera en que las máquinas aprenden; y desarrollos futuros como la computación cuántica). Además, se exploran aplicaciones en áreas fundamentales para el desarrollo científico y tecnológico del país y el mundo, es decir, aplicaciones de computación en finanzas, salud, electricidad, agro y manufactura, entre otras. Objetivo: Presentar a los estudiantes en el marco de un diálogo dinámico y didáctico, los aspectos generales, históricos y avances recientes relacionados con el estudio de elementos histórico-culturales de la computación."
          },
          {
            "codigo": "3007852",
            "nombre": "INGENIERÍA DE REQUISITOS",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3007853",
              "3007744",
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: OBJETIVO GENERAL: Practicar los conocimientos adquiridos en las asignaturas previas en la elaboración de las fases de definición y análisis de un Sistema Informático que solucione los problemas particulares de una organización. OBJETIVOS ESPECÍFICOS: - Identificar el dominio de un problema particular, reconociendo sus problemas y el entorno de la organización. - Conceptualizar una solución informática que tome en consideración los problemas de la organización. - Especificar la solución empleando para ello métodos formales y semiformales. METODOLOGÍA Y EVALUACIÓN: - Clases Magistrales. - Elaboración de un Trabajo Práctico por entregas. - Foros de Discusión."
          }
        ]
      },
      {
        "id": "m1753161699950",
        "posicion": 7,
        "asignaturas": [
          {
            "codigo": "3010440",
            "nombre": "Calidad de software",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3007852",
              "3007853",
              "3007744"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Hoy en dia la calidad se ha convertido en un aspecto importante en el contexto del desarrollo de software. La competitividad del mercado y los nuevos avances tecnológicos requieren de mayor innovación y calidad en los productos. Cada vez se incrementa el número de procesadores, se agregan nuevas funcionalidades, se requiere de nuevas características de conectividad, de seguridad, de interoperabilidad entre muchas otras. El riesgo de fallos en los sistemas aumenta conforme la creciente complejidad tecnológica y contenido software]. Evidencia de ello es el incremento de reportes de incidentes con software. En esta asignatura se presentan los conceptos básicos en sistemas de gestion de calidad, proceso software, modelos de calidad y métricas, de tal forma que pueda ser llevado a contextos industriales. OBJETIVO GENERAL Promover la cultura de la calidad en las diferentes fases del ciclo de vida del software, como una manera de garantizar la entrega de buenas aplicaciones. OBJETIVOS ESPECIFICOS 1. Lograr la difusión de los lineamientos teóricos y los diferentes estándares asociados con procesos de calidad del software. 2. Establecer los métodos necesarios para incorporar los estándares en las diferentes organizaciones de software. 3. Promover los procesos de ejecución de pruebas al interior de las organizaciones para garantizar la calidad de los productos.",
            "avance": false,
            "avanceTipologia": "",
            "avancePorcentaje": ""
          },
          {
            "codigo": "3011020",
            "nombre": "Fundamentos de analítica",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3010651",
              "3007847",
              "3007741",
              "3007744",
              "3010435",
              "1000003-M",
              "1000005-M"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "La Analítica se refiere al uso de grandes volúmenes de datos para el análisis y la toma de decisiones en contextos empresariales y de negocios. En esta área confluyen los conocimientos y saberes propios de cuatro grandes áreas de conocimiento: la computación, la estadística, el aprendizaje de máquinas y la investigación de operaciones. En este curso se abordan sus elementos fundamentales de la analítica y se busca que el estudiante desarrolle conocimientos, destrezas y habilidades básicas para la manipulación y modelado de grandes volúmenes de datos y la toma de decisiones.",
            "avance": false,
            "avanceTipologia": "",
            "avancePorcentaje": ""
          },
          {
            "codigo": "3010408",
            "nombre": "Fundamentos de proyectos en ingeniería",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "El objetivo principal del curso, que utiliza la metodología de aprendizaje basado en proyectos, es desarrollar pensamiento crítico y habilidades para resolver problemas, analizando el entorno y desarrollando el estado del arte del tema a trabajar para plantear soluciones a problemas reales. A través del trabajo en equipo de un proyecto, el estudiante desarrolla habilidades profesionales transversales, tales como comunicación (escrita y oral), toma de decisiones, trabajo en equipo y gestión de proyectos. Objetivos - Conocer y aplicar técnicas de identificación, caracterización y análisis de problemáticas, problemas, necesidades u oportunidades (PNO) en ing. - Plantear y analizar alternativas de solución en ing. - Plantear soluciones en ing. adaptadas a PNO reales y/o locales. - Identificar costos de la propuesta. Temas que aportan conocimiento nuevo para desarrollar capacidades de formulación y ejecución de proyectos: - Marco Lógico. - Introducción al diseño en Ing. - Búsqueda de información relevante. - Toma de decisiones en ing. - Análisis básico de costos. El curso se enmarca en la identificación de una PNO del contexto real, el estudiante tiene la posibilidad de explorar temas de interés. Los proyectos pueden tener diferentes orígenes. Autocoevaluación aplicada a la nota final, instrumento que permite la evaluación entre los integrantes de cada equipo. Las notas serán las correspondientes al integrante que menos saque. Cada nota se relaciona con el trabajo en equipo. PRÁCTICA: el desarrollo de los temas de la asignatura podrá tener como complemento el desarrollo de prácticas extramurales, visitas técnicas, salidas de campo; en la ciudad de Medellín o en los Municipios del departamento de Antioquia; las cuales estarán supeditadas al cumplimiento de los requerimientos definidos por la Universidad Nacional de Colombia.Tendrá una duración de 1 o máximo 2 días según el alcance de la práctica(aprobado por el CFM 5/12/2024 oficio M.FM.1.004-7224 del 6/12/2024).",
            "avance": false,
            "avanceTipologia": "",
            "avancePorcentaje": ""
          },
          {
            "codigo": "3010476",
            "nombre": "Introducción a la inteligencia artificial",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3010651",
              "3007847",
              "3007741",
              "3007744",
              "1000003-M",
              "1000005-M"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "El objetivo de la asignatura es ofrecer una introducción a la Inteligencia Artificial: sus fundamentos, áreas de aplicación y problemas que intenta resolver, así como desarrollar un conjunto de las técnicas más usadas en este campo. En particular se estudiarán diferentes sistemas desarrollados en IA, así como modelos representación del conocimiento."
          },
          {
            "codigo": "3007331",
            "nombre": "SIMULACIÓN DE SISTEMAS",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3010651",
              "3007324",
              "3010435",
              "1000003-M",
              "1000005-M"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: El objetivo general está compuesto por dos partes. En su primera parte se estudia la simulación de eventos discretos, sus fundamentos, aspectos metodológicos generales y un buen número de aplicaciones, casos y ejemplos; además, se exponen los elementos básicos de software específico para la simulación discreta SIMUL8. En su segunda parte se presentan otras aproximaciones para la simulación con Dinámica de Sistemas y Simulación Basada en Agentes."
          },
          {
            "codigo": "3007848",
            "nombre": "BASE DE DATOS II",
            "creditos": 3,
            "tipologia": "Disciplinar Optativa",
            "prerrequisitos": [
              "3007847",
              "3007744",
              "3010435"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "El objetivo general de la asignatura es ampliar los conocimientos en Bases de Datos para un mejor aprovechamiento de esta tecnología, adquiriendo destrezas y habilidades para la creación de sistemas de bases de datos de alta calidad y para la administración de una base de datos, recurso vital para cualquier organización actual. El alumno después de cursar la asignatura estará en capacidad de: - Crear procedimientos o funciones almacenadas, disparadores y otros objetos en un Sistema Gestor de Bases de Datos específico. - Diferenciar los conceptos de la orientación por objetos del Modelo Objeto-Relacional y establecer comparaciones frente al modelo relacional. - Distinguir cada una de las responsabilidades de un administrador de una base de datos y cómo llevarlas a cabo. - Diseñar y construir sistemas de bases de datos en la Web."
          },
          {
            "codigo": "TEST001",
            "nombre": "PRUEBA API BACKEND",
            "creditos": 4,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Asignatura de prueba para verificar que el frontend consume la API del backend correctamente.",
            "avance": false,
            "avanceTipologia": "",
            "avancePorcentaje": ""
          }
        ]
      },
      {
        "id": "m1753161731616",
        "posicion": 8,
        "asignaturas": [
          {
            "codigo": "3010415",
            "nombre": "Introducción al análisis de decisiones",
            "creditos": 3,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [
              "3007331",
              "3010651",
              "3007324",
              "3010435",
              "1000003-M",
              "1000005-M"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Objetivo: Brindar a los estudiantes elementos y herramientas de la teoría moderna de análisis de decisiones, así como diferentes herramientas de software, para enfrentar los procesos de toma de decisión al interior de la organización. Objetivos Específicos - Enseñar las diferencias existentes entre Modelación de Decisiones, Modelación de Incertidumbres y Modelación de Preferencias. - Presentar y discutir los posibles criterios a tener en cuenta en los procesos de toma de decisiones. - Presentar y discutir algunos métodos de análisis multiobjetivo y sus aplicaciones en procesos de toma de decisiones. - Aprender a manejar algunos sistemas soporte a la decisión. Metodología: Exposiciones magistrales presentadas por medio de Video Beam, y copias de las clases y difusión de información vía Internet. Realización de por lo menos, cuatro parciales y dos trabajos"
          },
          {
            "nombre": "Estructuración y evaluación de proyectos de ingeniería",
            "codigo": "3010407",
            "creditos": "3",
            "tipologia": "Disciplinar Obligatoria",
            "descripcion": "El objetivo principal del curso, que utiliza la metodología de aprendizaje basado en proyectos, es desarrollar pensamiento crítico y habilidades para resolver problemas, analizando el entorno y desarrollando el estado del arte del tema a trabajar para plantear soluciones a problemas reales. A través del trabajo en equipo de un proyecto, se desarrolla habilidades profesionales transversales, como comunicación (escrita y oral), toma de decisiones, trabajo en equipo y gestión de proyectos. En las herramientas ambientales, financieras y económicas (AFE) se estudian casos en parejas aleatorias para el desarrollo de habilidades transversales y apropiación de conceptos, se realiza un parcial individual de herramientas financieras para evaluar conceptos. Aporta conocimientos en herramientas de estructuración y evaluación de proyectos (EEP) desde AFE con aspectos técnicos y legales, para evaluar factibilidad y viabilidad de proy. productivos. Objetivos- Identificar, caracterizar y analizar un problema u oportunidad (PO) reales. - Adquirir conocimientos avanzados de gestión y planeación de proy. de ing.- Introducir en el diseño y uso de herramientas para la (EEP) de ing. a nivel AFE. - Evaluar la viabilidad técnica, AFE de proyectos productivos. Autocoevaluación aplicada a la nota final del proyecto (50%), instrumento que permite evaluar trabajo en equipo. Las notas serán las correspondientes al integrante que menos saque. Cada nota se relaciona con trabajo en equipo.\nPRÁCTICA: el desarrollo de los temas de la asignatura podrá tener como complemento el desarrollo de prácticas extramurales, visitas técnicas, salidas de campo; en la ciudad de Medellín o en los Municipios del departamento de Antioquia; las cuales estarán supeditadas al cumplimiento de los requerimientos definidos por la Universidad Nacional de Colombia. Tendrá una duración de 1 o máximo 2 días según el alcance de la práctica (aprobado por el Consejo de la Facultad de Minas el 5 de diciembre de 2024, Acta 33).",
            "prerrequisitos": [
              "3010408"
            ],
            "avance": true,
            "avanceTipologia": "Disciplinar",
            "avancePorcentaje": "20",
            "id": "1753139922486"
          },
          {
            "codigo": "3011019",
            "nombre": "Desarrollo web I (LA MEJOR)",
            "creditos": 3,
            "tipologia": "Disciplinar Optativa",
            "prerrequisitos": [
              "3007847",
              "3007865"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "En esta asignatura, el/la estudiante aplicará sus conocimientos en programación y desarrollo de software en general para construir un desarrollo para la web con un enfoque práctico y aplicativo. Recorrerá desde los fundamentos esenciales del protocolo HTTP, pasando por las tecnologías de frontend y backend, para terminar con un conocimiento esencial en la construcción de aplicaciones web fullstack."
          },
          {
            "codigo": "3006931",
            "nombre": "INTRODUCCIÓN AL MANEJO DE DATOS ESTADÍSTICOS",
            "creditos": 4,
            "tipologia": "Fundamentación Optativa",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Este curso esta diseñado para los estudiantes de primer semetre de la carrera de estadística para que adquieran un panorama general de los tópicos fundamentales de la estadística y para estimular el pensamiento estadístico. Objetivos: 1. Explorar de manera intuitiva los principales tópicos en estadística. 2. Manejar el vocabulario esencial en el contexto estadístico. 3. Realizar trabajos sencillos de experimentación en el contexto de la rigurosidad estadística. 4. Reconocer el uso apropiado de la estadística en contextos reales y distinguirlo del abuso que se puede hacer de la estadística."
          },
          {
            "codigo": "L016",
            "nombre": "MÚSICA Y SOCIEDAD",
            "creditos": 2,
            "tipologia": "Libre Elección",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Análisis de la música como fenómeno social y cultural, y su impacto en diferentes contextos históricos."
          },
          {
            "codigo": "3011018",
            "nombre": "Creación multimedia",
            "creditos": 3,
            "tipologia": "Disciplinar Optativa",
            "prerrequisitos": [
              "3007744"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "En esta asignatura, el/la estudiante adquirirá competencias en la ingeniería aplicada al arte en diferentes formatos digitales."
          },
          {
            "codigo": "3010757",
            "nombre": "Aplicaciones móviles",
            "creditos": 3,
            "tipologia": "Disciplinar Optativa",
            "prerrequisitos": [
              "3007847",
              "3007865"
            ],
            "correrquisitos": [],
            "disponible": false,
            "descripcion": "El curso de Introducción a las ciencias de la computación y aplicaciones móviles se enfoca en integrar en el estudiante: la comprensión amplia y robusta de la informática y la programación; cómo pensar algorítmicamente y resolver problemas de programación de manera eficiente; conceptos como abstracción, gestión de recursos, seguridad, ingeniería de software y bajo la perspectiva del desarrollo de aplicaciones móviles. Además, a través de proyectos prácticos, ganará experiencia en el desarrollo de aplicaciones móviles y sus paradigmas, arquitectura de aplicaciones e interfaces de usuario. El curso culmina en un proyecto final para el cual implementará una aplicación para resolver un problema específico."
          }
        ]
      },
      {
        "id": "m1753161733715",
        "posicion": 9,
        "asignaturas": [
          {
            "codigo": "3007595",
            "nombre": "REDES TELEINFORMATICAS I",
            "creditos": 4,
            "tipologia": "Disciplinar Optativa",
            "prerrequisitos": [
              "3007847"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Este curso introduce la arquitectura, funciones, componentes y modelos de Internet y otras redes de computadores. Utiliza los modelos por capas OSI y TCP para examinar la naturaleza y roles de protocolos y servicios en las capas de aplicación, red, enlace de datos y física. Los principios y estructura del direccionamiento IP y las bases de conceptos, medios y operaciones de Ethernet son dados como base del curso. Los laboratorios utilizan un modelo Internet para analizar datos reales sin afectar el desempeño de la red. Actividades en el software Packet Tracer ayudan a analizar la operación de la red y de diferentes protocolos, además de construir pequeños ambientes simulados de redes. Al final del curso, los estudiantes construyen simples topologías LAN aplicando los conceptos básicos de cableado, realizando configuraciones básicas en dispositivos como switches y routers, así como la implementación de esquemas de direccionamiento."
          },
          {
            "codigo": "3006907",
            "nombre": "MÉTODOS NUMÉRICOS",
            "creditos": 4,
            "tipologia": "Fundamentación Optativa",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "OBJETIVOS: Conseguir una comprensión integral de los métodos numéricos que incluya los teoremas en los que se basan, la forma como se definen y como se calcula con ellos en el computador. Utilizar MATLAB como herramienta principal para la computación. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brindadas, tanto por los profesores de planta como por los monitores académicos de posgrado y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
          },
          {
            "codigo": "3010439",
            "nombre": "Proyecto Integrado de Ingeniería",
            "creditos": 4,
            "tipologia": "Disciplinar Obligatoria",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "El objetivo principal de este curso, que utiliza la metodología de aprendizaje basado en proyectos, es desarrollar en el estudiante pensamiento crítico y habilidades para resolver problemas, mediante el análisis del entorno y la búsqueda del estado del arte en el tema a desarrollar, y plantear soluciones sostenibles a problemas reales. A través del trabajo en un proyecto de equipo, y del conocimiento de otros proyectos, el estudiante también desarrolla habilidades profesionales transversales, tales como la comunicación (escrita y oral), la toma de decisiones, el trabajo en equipo y la gestión de proyectos. Objetivos del curso. - Formular un proyecto de ingeniería dirigido a la solución de un problema real o al aprovechamiento de una oportunidad. - Adquirir habilidades de gestión y planeación de proyectos de ingeniería. - Adquirir conocimientos sobre métodos, estrategias y técnicas para el diseño en ingeniería. - Proponer y desarrollar una solución real aplicando conceptos de diseño en ingeniería a nivel técnico, ambiental y financiero. - Evaluar la viabilidad técnica, financiera y ambiental mediante técnicas de análisis, modelos y prototipos de funcionamiento. Autocoevaluación aplicada a la nota final del proyecto (100%), se aplicará un instrumento que permita la evaluación entre los integrantes del grupo y los equipos conformados a su interior. Las notas del equipo serán las correspondientes al integrante que menos saque. Cada nota es relacionada con el trabajo en equipo. PRÁCTICA: el desarrollo de los temas de la asignatura podrá tener como complemento el desarrollo de prácticas extramurales, visitas técnicas, salidas de campo; en la ciudad de Medellín o en los Municipios del departamento de Antioquia; las cuales estarán supeditadas al cumplimiento de los requerimientos definidos por la Universidad Nacional de Colombia. Tendrá una duración de 1 o máximo 2 días según el alcance de la práctica (Consejo de la Facultad de Minas el 5 de diciembre de 2024, Acta 33)."
          },
          {
            "codigo": "3011093",
            "nombre": "Computación paralela",
            "creditos": 3,
            "tipologia": "Disciplinar Optativa",
            "prerrequisitos": [
              "3007741",
              "3007847"
            ],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "En este curso se presentan los fundamentos de la computación en paralelo. Se presenta una introducción al tema y un conjunto de algoritmos convencionales para ilustrar el paralelismo, inicialmente, mediante algoritmos (pseudo-código). Se presenta posteriormente algún lenguaje de programación para implementar estos algoritmos. Luego, se presenta la aplicación del paralelismo mediante alguna herramienta o lenguaje de programación a un nivel más alto, es decir, mediante herramientas o lenguajes que ofrecen facilidades tales como funciones (o bibliotecas) preconstruidas que explotan el paralelismo. Objetivos: 1. Presentar los fundamentos de la computación en paralelo. 2. Presentar algoritmos donde se aplica programación en paralelo. 3. Presentar un lenguaje de programación que soporte paralelismo para implementar los algoritmos presentados. 4. Presentar una herramienta o lenguaje de programación que ofrezca funcionalidades de alto nivel para explotar el paralelismo."
          }
        ]
      },
      {
        "id": "m1753161850102",
        "posicion": 10,
        "asignaturas": [
          {
            "codigo": "3007869",
            "nombre": "CURSOS DE POSGRADO",
            "creditos": 6,
            "tipologia": "Trabajo de Grado",
            "prerrequisitos": [],
            "correrquisitos": [],
            "disponible": true,
            "descripcion": "Asignatura que permite al estudiante cursar materias de posgrado como parte de su formación de pregrado, contribuyendo a su preparación académica avanzada."
          }
        ]
      }
    ],
    "creditos": {
      "fundamentacionObligatoria": 0,
      "fundamentacionOptativa": 0,
      "disciplinarObligatoria": 0,
      "disciplinarOptativa": 0,
      "libreEleccion": 0,
      "total": 0
    },
    "id": "306831"
  }
]